garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f55q71.h
// Register: PORTD
#define PORTD PORTD
extern volatile unsigned char           PORTD               __at(0x153);
#ifndef _LIB_BUILD
asm("PORTD equ 0153h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD0                    :1;
        unsigned RD1                    :1;
        unsigned RD2                    :1;
        unsigned RD3                    :1;
        unsigned RD4                    :1;
        unsigned RD5                    :1;
        unsigned RD6                    :1;
        unsigned RD7                    :1;
    };
} PORTDbits_t;
extern volatile PORTDbits_t PORTDbits __at(0x153);
// bitfield macros
#define _PORTD_RD0_POSN                                     0x0
#define _PORTD_RD0_POSITION                                 0x0
#define _PORTD_RD0_SIZE                                     0x1
#define _PORTD_RD0_LENGTH                                   0x1
#define _PORTD_RD0_MASK                                     0x1
#define _PORTD_RD1_POSN                                     0x1
#define _PORTD_RD1_POSITION                                 0x1
#define _PORTD_RD1_SIZE                                     0x1
#define _PORTD_RD1_LENGTH                                   0x1
#define _PORTD_RD1_MASK                                     0x2
#define _PORTD_RD2_POSN                                     0x2
#define _PORTD_RD2_POSITION                                 0x2
#define _PORTD_RD2_SIZE                                     0x1
#define _PORTD_RD2_LENGTH                                   0x1
#define _PORTD_RD2_MASK                                     0x4
#define _PORTD_RD3_POSN                                     0x3
#define _PORTD_RD3_POSITION                                 0x3
#define _PORTD_RD3_SIZE                                     0x1
#define _PORTD_RD3_LENGTH                                   0x1
#define _PORTD_RD3_MASK                                     0x8
#define _PORTD_RD4_POSN                                     0x4
#define _PORTD_RD4_POSITION                                 0x4
#define _PORTD_RD4_SIZE                                     0x1
#define _PORTD_RD4_LENGTH                                   0x1
#define _PORTD_RD4_MASK                                     0x10
#define _PORTD_RD5_POSN                                     0x5
#define _PORTD_RD5_POSITION                                 0x5
#define _PORTD_RD5_SIZE                                     0x1
#define _PORTD_RD5_LENGTH                                   0x1
#define _PORTD_RD5_MASK                                     0x20
#define _PORTD_RD6_POSN                                     0x6
#define _PORTD_RD6_POSITION                                 0x6
#define _PORTD_RD6_SIZE                                     0x1
#define _PORTD_RD6_LENGTH                                   0x1
#define _PORTD_RD6_MASK                                     0x40
#define _PORTD_RD7_POSN                                     0x7
#define _PORTD_RD7_POSITION                                 0x7
#define _PORTD_RD7_SIZE                                     0x1
#define _PORTD_RD7_LENGTH                                   0x1
#define _PORTD_RD7_MASK                                     0x80

// Register: PORTE
#define PORTE PORTE
extern volatile unsigned char           PORTE               __at(0x154);
#ifndef _LIB_BUILD
asm("PORTE equ 0154h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE0                    :1;
        unsigned RE1                    :1;
        unsigned RE2                    :1;
        unsigned RE3                    :1;
    };
} PORTEbits_t;
extern volatile PORTEbits_t PORTEbits __at(0x154);
// bitfield macros
#define _PORTE_RE0_POSN                                     0x0
#define _PORTE_RE0_POSITION                                 0x0
#define _PORTE_RE0_SIZE                                     0x1
#define _PORTE_RE0_LENGTH                                   0x1
#define _PORTE_RE0_MASK                                     0x1
#define _PORTE_RE1_POSN                                     0x1
#define _PORTE_RE1_POSITION                                 0x1
#define _PORTE_RE1_SIZE                                     0x1
#define _PORTE_RE1_LENGTH                                   0x1
#define _PORTE_RE1_MASK                                     0x2
#define _PORTE_RE2_POSN                                     0x2
#define _PORTE_RE2_POSITION                                 0x2
#define _PORTE_RE2_SIZE                                     0x1
#define _PORTE_RE2_LENGTH                                   0x1
#define _PORTE_RE2_MASK                                     0x4
#define _PORTE_RE3_POSN                                     0x3
#define _PORTE_RE3_POSITION                                 0x3
#define _PORTE_RE3_SIZE                                     0x1
#define _PORTE_RE3_LENGTH                                   0x1
#define _PORTE_RE3_MASK                                     0x8

// Register: PORTF
#define PORTF PORTF
extern volatile unsigned char           PORTF               __at(0x155);
#ifndef _LIB_BUILD
asm("PORTF equ 0155h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RF0                    :1;
        unsigned RF1                    :1;
        unsigned RF2                    :1;
        unsigned RF3                    :1;
        unsigned RF4                    :1;
        unsigned RF5                    :1;
        unsigned RF6                    :1;
        unsigned RF7                    :1;
    };
} PORTFbits_t;
extern volatile PORTFbits_t PORTFbits __at(0x155);
// bitfield macros
#define _PORTF_RF0_POSN                                     0x0
#define _PORTF_RF0_POSITION                                 0x0
#define _PORTF_RF0_SIZE                                     0x1
#define _PORTF_RF0_LENGTH                                   0x1
#define _PORTF_RF0_MASK                                     0x1
#define _PORTF_RF1_POSN                                     0x1
#define _PORTF_RF1_POSITION                                 0x1
#define _PORTF_RF1_SIZE                                     0x1
#define _PORTF_RF1_LENGTH                                   0x1
#define _PORTF_RF1_MASK                                     0x2
#define _PORTF_RF2_POSN                                     0x2
#define _PORTF_RF2_POSITION                                 0x2
#define _PORTF_RF2_SIZE                                     0x1
#define _PORTF_RF2_LENGTH                                   0x1
#define _PORTF_RF2_MASK                                     0x4
#define _PORTF_RF3_POSN                                     0x3
#define _PORTF_RF3_POSITION                                 0x3
#define _PORTF_RF3_SIZE                                     0x1
#define _PORTF_RF3_LENGTH                                   0x1
#define _PORTF_RF3_MASK                                     0x8
#define _PORTF_RF4_POSN                                     0x4
#define _PORTF_RF4_POSITION                                 0x4
#define _PORTF_RF4_SIZE                                     0x1
#define _PORTF_RF4_LENGTH                                   0x1
#define _PORTF_RF4_MASK                                     0x10
#define _PORTF_RF5_POSN                                     0x5
#define _PORTF_RF5_POSITION                                 0x5
#define _PORTF_RF5_SIZE                                     0x1
#define _PORTF_RF5_LENGTH                                   0x1
#define _PORTF_RF5_MASK                                     0x20
#define _PORTF_RF6_POSN                                     0x6
#define _PORTF_RF6_POSITION                                 0x6
#define _PORTF_RF6_SIZE                                     0x1
#define _PORTF_RF6_LENGTH                                   0x1
#define _PORTF_RF6_MASK                                     0x40
#define _PORTF_RF7_POSN                                     0x7
#define _PORTF_RF7_POSITION                                 0x7
#define _PORTF_RF7_SIZE                                     0x1
#define _PORTF_RF7_LENGTH                                   0x1
#define _PORTF_RF7_MASK                                     0x80

// Register: APMCON
#define APMCON APMCON
extern volatile unsigned char           APMCON              __at(0x1C0);
#ifndef _LIB_BUILD
asm("APMCON equ 01C0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :7;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :7;
        unsigned APMEN                  :1;
    };
} APMCONbits_t;
extern volatile APMCONbits_t APMCONbits __at(0x1C0);
// bitfield macros
#define _APMCON_EN_POSN                                     0x7
#define _APMCON_EN_POSITION                                 0x7
#define _APMCON_EN_SIZE                                     0x1
#define _APMCON_EN_LENGTH                                   0x1
#define _APMCON_EN_MASK                                     0x80
#define _APMCON_APMEN_POSN                                  0x7
#define _APMCON_APMEN_POSITION                              0x7
#define _APMCON_APMEN_SIZE                                  0x1
#define _APMCON_APMEN_LENGTH                                0x1
#define _APMCON_APMEN_MASK                                  0x80

// Register: APMPRE
#define APMPRE APMPRE
extern volatile unsigned short          APMPRE              __at(0x1C1);
#ifndef _LIB_BUILD
asm("APMPRE equ 01C1h");
#endif

// Register: APMPREL
#define APMPREL APMPREL
extern volatile unsigned char           APMPREL             __at(0x1C1);
#ifndef _LIB_BUILD
asm("APMPREL equ 01C1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRE                    :8;
    };
    struct {
        unsigned PRE0                   :1;
        unsigned PRE1                   :1;
        unsigned PRE2                   :1;
        unsigned PRE3                   :1;
        unsigned PRE4                   :1;
        unsigned PRE5                   :1;
        unsigned PRE6                   :1;
        unsigned PRE7                   :1;
    };
    struct {
        unsigned APMPRE                 :8;
    };
    struct {
        unsigned APMPRE0                :1;
        unsigned APMPRE1                :1;
        unsigned APMPRE2                :1;
        unsigned APMPRE3                :1;
        unsigned APMPRE4                :1;
        unsigned APMPRE5                :1;
        unsigned APMPRE6                :1;
        unsigned APMPRE7                :1;
    };
} APMPRELbits_t;
extern volatile APMPRELbits_t APMPRELbits __at(0x1C1);
// bitfield macros
#define _APMPREL_PRE_POSN                                   0x0
#define _APMPREL_PRE_POSITION                               0x0
#define _APMPREL_PRE_SIZE                                   0x8
#define _APMPREL_PRE_LENGTH                                 0x8
#define _APMPREL_PRE_MASK                                   0xFF
#define _APMPREL_PRE0_POSN                                  0x0
#define _APMPREL_PRE0_POSITION                              0x0
#define _APMPREL_PRE0_SIZE                                  0x1
#define _APMPREL_PRE0_LENGTH                                0x1
#define _APMPREL_PRE0_MASK                                  0x1
#define _APMPREL_PRE1_POSN                                  0x1
#define _APMPREL_PRE1_POSITION                              0x1
#define _APMPREL_PRE1_SIZE                                  0x1
#define _APMPREL_PRE1_LENGTH                                0x1
#define _APMPREL_PRE1_MASK                                  0x2
#define _APMPREL_PRE2_POSN                                  0x2
#define _APMPREL_PRE2_POSITION                              0x2
#define _APMPREL_PRE2_SIZE                                  0x1
#define _APMPREL_PRE2_LENGTH                                0x1
#define _APMPREL_PRE2_MASK                                  0x4
#define _APMPREL_PRE3_POSN                                  0x3
#define _APMPREL_PRE3_POSITION                              0x3
#define _APMPREL_PRE3_SIZE                                  0x1
#define _APMPREL_PRE3_LENGTH                                0x1
#define _APMPREL_PRE3_MASK                                  0x8
#define _APMPREL_PRE4_POSN                                  0x4
#define _APMPREL_PRE4_POSITION                              0x4
#define _APMPREL_PRE4_SIZE                                  0x1
#define _APMPREL_PRE4_LENGTH                                0x1
#define _APMPREL_PRE4_MASK                                  0x10
#define _APMPREL_PRE5_POSN                                  0x5
#define _APMPREL_PRE5_POSITION                              0x5
#define _APMPREL_PRE5_SIZE                                  0x1
#define _APMPREL_PRE5_LENGTH                                0x1
#define _APMPREL_PRE5_MASK                                  0x20
#define _APMPREL_PRE6_POSN                                  0x6
#define _APMPREL_PRE6_POSITION                              0x6
#define _APMPREL_PRE6_SIZE                                  0x1
#define _APMPREL_PRE6_LENGTH                                0x1
#define _APMPREL_PRE6_MASK                                  0x40
#define _APMPREL_PRE7_POSN                                  0x7
#define _APMPREL_PRE7_POSITION                              0x7
#define _APMPREL_PRE7_SIZE                                  0x1
#define _APMPREL_PRE7_LENGTH                                0x1
#define _APMPREL_PRE7_MASK                                  0x80
#define _APMPREL_APMPRE_POSN                                0x0
#define _APMPREL_APMPRE_POSITION                            0x0
#define _APMPREL_APMPRE_SIZE                                0x8
#define _APMPREL_APMPRE_LENGTH                              0x8
#define _APMPREL_APMPRE_MASK                                0xFF
#define _APMPREL_APMPRE0_POSN                               0x0
#define _APMPREL_APMPRE0_POSITION                           0x0
#define _APMPREL_APMPRE0_SIZE                               0x1
#define _APMPREL_APMPRE0_LENGTH                             0x1
#define _APMPREL_APMPRE0_MASK                               0x1
#define _APMPREL_APMPRE1_POSN                               0x1
#define _APMPREL_APMPRE1_POSITION                           0x1
#define _APMPREL_APMPRE1_SIZE                               0x1
#define _APMPREL_APMPRE1_LENGTH                             0x1
#define _APMPREL_APMPRE1_MASK                               0x2
#define _APMPREL_APMPRE2_POSN                               0x2
#define _APMPREL_APMPRE2_POSITION                           0x2
#define _APMPREL_APMPRE2_SIZE                               0x1
#define _APMPREL_APMPRE2_LENGTH                             0x1
#define _APMPREL_APMPRE2_MASK                               0x4
#define _APMPREL_APMPRE3_POSN                               0x3
#define _APMPREL_APMPRE3_POSITION                           0x3
#define _APMPREL_APMPRE3_SIZE                               0x1
#define _APMPREL_APMPRE3_LENGTH                             0x1
#define _APMPREL_APMPRE3_MASK                               0x8
#define _APMPREL_APMPRE4_POSN                               0x4
#define _APMPREL_APMPRE4_POSITION                           0x4
#define _APMPREL_APMPRE4_SIZE                               0x1
#define _APMPREL_APMPRE4_LENGTH                             0x1
#define _APMPREL_APMPRE4_MASK                               0x10
#define _APMPREL_APMPRE5_POSN                               0x5
#define _APMPREL_APMPRE5_POSITION                           0x5
#define _APMPREL_APMPRE5_SIZE                               0x1
#define _APMPREL_APMPRE5_LENGTH                             0x1
#define _APMPREL_APMPRE5_MASK                               0x20
#define _APMPREL_APMPRE6_POSN                               0x6
#define _APMPREL_APMPRE6_POSITION                           0x6
#define _APMPREL_APMPRE6_SIZE                               0x1
#define _APMPREL_APMPRE6_LENGTH                             0x1
#define _APMPREL_APMPRE6_MASK                               0x40
#define _APMPREL_APMPRE7_POSN                               0x7
#define _APMPREL_APMPRE7_POSITION                           0x7
#define _APMPREL_APMPRE7_SIZE                               0x1
#define _APMPREL_APMPRE7_LENGTH                             0x1
#define _APMPREL_APMPRE7_MASK                               0x80

// Register: APMPREH
#define APMPREH APMPREH
extern volatile unsigned char           APMPREH             __at(0x1C2);
#ifndef _LIB_BUILD
asm("APMPREH equ 01C2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRE                    :8;
    };
    struct {
        unsigned PRE8                   :1;
        unsigned PRE9                   :1;
        unsigned PRE10                  :1;
        unsigned PRE11                  :1;
        unsigned PRE12                  :1;
        unsigned PRE13                  :1;
        unsigned PRE14                  :1;
        unsigned PRE15                  :1;
    };
    struct {
        unsigned APMPRE                 :8;
    };
    struct {
        unsigned APMPRE8                :1;
        unsigned APMPRE9                :1;
        unsigned APMPRE10               :1;
        unsigned APMPRE11               :1;
        unsigned APMPRE12               :1;
        unsigned APMPRE13               :1;
        unsigned APMPRE14               :1;
        unsigned APMPRE15               :1;
    };
} APMPREHbits_t;
extern volatile APMPREHbits_t APMPREHbits __at(0x1C2);
// bitfield macros
#define _APMPREH_PRE_POSN                                   0x0
#define _APMPREH_PRE_POSITION                               0x0
#define _APMPREH_PRE_SIZE                                   0x8
#define _APMPREH_PRE_LENGTH                                 0x8
#define _APMPREH_PRE_MASK                                   0xFF
#define _APMPREH_PRE8_POSN                                  0x0
#define _APMPREH_PRE8_POSITION                              0x0
#define _APMPREH_PRE8_SIZE                                  0x1
#define _APMPREH_PRE8_LENGTH                                0x1
#define _APMPREH_PRE8_MASK                                  0x1
#define _APMPREH_PRE9_POSN                                  0x1
#define _APMPREH_PRE9_POSITION                              0x1
#define _APMPREH_PRE9_SIZE                                  0x1
#define _APMPREH_PRE9_LENGTH                                0x1
#define _APMPREH_PRE9_MASK                                  0x2
#define _APMPREH_PRE10_POSN                                 0x2
#define _APMPREH_PRE10_POSITION                             0x2
#define _APMPREH_PRE10_SIZE                                 0x1
#define _APMPREH_PRE10_LENGTH                               0x1
#define _APMPREH_PRE10_MASK                                 0x4
#define _APMPREH_PRE11_POSN                                 0x3
#define _APMPREH_PRE11_POSITION                             0x3
#define _APMPREH_PRE11_SIZE                                 0x1
#define _APMPREH_PRE11_LENGTH                               0x1
#define _APMPREH_PRE11_MASK                                 0x8
#define _APMPREH_PRE12_POSN                                 0x4
#define _APMPREH_PRE12_POSITION                             0x4
#define _APMPREH_PRE12_SIZE                                 0x1
#define _APMPREH_PRE12_LENGTH                               0x1
#define _APMPREH_PRE12_MASK                                 0x10
#define _APMPREH_PRE13_POSN                                 0x5
#define _APMPREH_PRE13_POSITION                             0x5
#define _APMPREH_PRE13_SIZE                                 0x1
#define _APMPREH_PRE13_LENGTH                               0x1
#define _APMPREH_PRE13_MASK                                 0x20
#define _APMPREH_PRE14_POSN                                 0x6
#define _APMPREH_PRE14_POSITION                             0x6
#define _APMPREH_PRE14_SIZE                                 0x1
#define _APMPREH_PRE14_LENGTH                               0x1
#define _APMPREH_PRE14_MASK                                 0x40
#define _APMPREH_PRE15_POSN                                 0x7
#define _APMPREH_PRE15_POSITION                             0x7
#define _APMPREH_PRE15_SIZE                                 0x1
#define _APMPREH_PRE15_LENGTH                               0x1
#define _APMPREH_PRE15_MASK                                 0x80
#define _APMPREH_APMPRE_POSN                                0x0
#define _APMPREH_APMPRE_POSITION                            0x0
#define _APMPREH_APMPRE_SIZE                                0x8
#define _APMPREH_APMPRE_LENGTH                              0x8
#define _APMPREH_APMPRE_MASK                                0xFF
#define _APMPREH_APMPRE8_POSN                               0x0
#define _APMPREH_APMPRE8_POSITION                           0x0
#define _APMPREH_APMPRE8_SIZE                               0x1
#define _APMPREH_APMPRE8_LENGTH                             0x1
#define _APMPREH_APMPRE8_MASK                               0x1
#define _APMPREH_APMPRE9_POSN                               0x1
#define _APMPREH_APMPRE9_POSITION                           0x1
#define _APMPREH_APMPRE9_SIZE                               0x1
#define _APMPREH_APMPRE9_LENGTH                             0x1
#define _APMPREH_APMPRE9_MASK                               0x2
#define _APMPREH_APMPRE10_POSN                              0x2
#define _APMPREH_APMPRE10_POSITION                          0x2
#define _APMPREH_APMPRE10_SIZE                              0x1
#define _APMPREH_APMPRE10_LENGTH                            0x1
#define _APMPREH_APMPRE10_MASK                              0x4
#define _APMPREH_APMPRE11_POSN                              0x3
#define _APMPREH_APMPRE11_POSITION                          0x3
#define _APMPREH_APMPRE11_SIZE                              0x1
#define _APMPREH_APMPRE11_LENGTH                            0x1
#define _APMPREH_APMPRE11_MASK                              0x8
#define _APMPREH_APMPRE12_POSN                              0x4
#define _APMPREH_APMPRE12_POSITION                          0x4
#define _APMPREH_APMPRE12_SIZE                              0x1
#define _APMPREH_APMPRE12_LENGTH                            0x1
#define _APMPREH_APMPRE12_MASK                              0x10
#define _APMPREH_APMPRE13_POSN                              0x5
#define _APMPREH_APMPRE13_POSITION                          0x5
#define _APMPREH_APMPRE13_SIZE                              0x1
#define _APMPREH_APMPRE13_LENGTH                            0x1
#define _APMPREH_APMPRE13_MASK                              0x20
#define _APMPREH_APMPRE14_POSN                              0x6
#define _APMPREH_APMPRE14_POSITION                          0x6
#define _APMPREH_APMPRE14_SIZE                              0x1
#define _APMPREH_APMPRE14_LENGTH                            0x1
#define _APMPREH_APMPRE14_MASK                              0x40
#define _APMPREH_APMPRE15_POSN                              0x7
#define _APMPREH_APMPRE15_POSITION                          0x7
#define _APMPREH_APMPRE15_SIZE                              0x1
#define _APMPREH_APMPRE15_LENGTH                            0x1
#define _APMPREH_APMPRE15_MASK                              0x80

// Register: APMPER
#define APMPER APMPER
extern volatile unsigned short          APMPER              __at(0x1C3);
#ifndef _LIB_BUILD
asm("APMPER equ 01C3h");
#endif

