garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f55q71.h
// Register: I2C1CNT
#define I2C1CNT I2C1CNT
extern volatile unsigned short          I2C1CNT             __at(0x28B);
#ifndef _LIB_BUILD
asm("I2C1CNT equ 028Bh");
#endif

// Register: I2C1CNTL
#define I2C1CNTL I2C1CNTL
extern volatile unsigned char           I2C1CNTL            __at(0x28B);
#ifndef _LIB_BUILD
asm("I2C1CNTL equ 028Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CNT                    :8;
    };
    struct {
        unsigned CNT0                   :1;
        unsigned CNT1                   :1;
        unsigned CNT2                   :1;
        unsigned CNT3                   :1;
        unsigned CNT4                   :1;
        unsigned CNT5                   :1;
        unsigned CNT6                   :1;
        unsigned CNT7                   :1;
    };
    struct {
        unsigned I2C1CNT                :8;
    };
    struct {
        unsigned I2C1CNT0               :1;
        unsigned I2C1CNT1               :1;
        unsigned I2C1CNT2               :1;
        unsigned I2C1CNT3               :1;
        unsigned I2C1CNT4               :1;
        unsigned I2C1CNT5               :1;
        unsigned I2C1CNT6               :1;
        unsigned I2C1CNT7               :1;
    };
} I2C1CNTLbits_t;
extern volatile I2C1CNTLbits_t I2C1CNTLbits __at(0x28B);
// bitfield macros
#define _I2C1CNTL_CNT_POSN                                  0x0
#define _I2C1CNTL_CNT_POSITION                              0x0
#define _I2C1CNTL_CNT_SIZE                                  0x8
#define _I2C1CNTL_CNT_LENGTH                                0x8
#define _I2C1CNTL_CNT_MASK                                  0xFF
#define _I2C1CNTL_CNT0_POSN                                 0x0
#define _I2C1CNTL_CNT0_POSITION                             0x0
#define _I2C1CNTL_CNT0_SIZE                                 0x1
#define _I2C1CNTL_CNT0_LENGTH                               0x1
#define _I2C1CNTL_CNT0_MASK                                 0x1
#define _I2C1CNTL_CNT1_POSN                                 0x1
#define _I2C1CNTL_CNT1_POSITION                             0x1
#define _I2C1CNTL_CNT1_SIZE                                 0x1
#define _I2C1CNTL_CNT1_LENGTH                               0x1
#define _I2C1CNTL_CNT1_MASK                                 0x2
#define _I2C1CNTL_CNT2_POSN                                 0x2
#define _I2C1CNTL_CNT2_POSITION                             0x2
#define _I2C1CNTL_CNT2_SIZE                                 0x1
#define _I2C1CNTL_CNT2_LENGTH                               0x1
#define _I2C1CNTL_CNT2_MASK                                 0x4
#define _I2C1CNTL_CNT3_POSN                                 0x3
#define _I2C1CNTL_CNT3_POSITION                             0x3
#define _I2C1CNTL_CNT3_SIZE                                 0x1
#define _I2C1CNTL_CNT3_LENGTH                               0x1
#define _I2C1CNTL_CNT3_MASK                                 0x8
#define _I2C1CNTL_CNT4_POSN                                 0x4
#define _I2C1CNTL_CNT4_POSITION                             0x4
#define _I2C1CNTL_CNT4_SIZE                                 0x1
#define _I2C1CNTL_CNT4_LENGTH                               0x1
#define _I2C1CNTL_CNT4_MASK                                 0x10
#define _I2C1CNTL_CNT5_POSN                                 0x5
#define _I2C1CNTL_CNT5_POSITION                             0x5
#define _I2C1CNTL_CNT5_SIZE                                 0x1
#define _I2C1CNTL_CNT5_LENGTH                               0x1
#define _I2C1CNTL_CNT5_MASK                                 0x20
#define _I2C1CNTL_CNT6_POSN                                 0x6
#define _I2C1CNTL_CNT6_POSITION                             0x6
#define _I2C1CNTL_CNT6_SIZE                                 0x1
#define _I2C1CNTL_CNT6_LENGTH                               0x1
#define _I2C1CNTL_CNT6_MASK                                 0x40
#define _I2C1CNTL_CNT7_POSN                                 0x7
#define _I2C1CNTL_CNT7_POSITION                             0x7
#define _I2C1CNTL_CNT7_SIZE                                 0x1
#define _I2C1CNTL_CNT7_LENGTH                               0x1
#define _I2C1CNTL_CNT7_MASK                                 0x80
#define _I2C1CNTL_I2C1CNT_POSN                              0x0
#define _I2C1CNTL_I2C1CNT_POSITION                          0x0
#define _I2C1CNTL_I2C1CNT_SIZE                              0x8
#define _I2C1CNTL_I2C1CNT_LENGTH                            0x8
#define _I2C1CNTL_I2C1CNT_MASK                              0xFF
#define _I2C1CNTL_I2C1CNT0_POSN                             0x0
#define _I2C1CNTL_I2C1CNT0_POSITION                         0x0
#define _I2C1CNTL_I2C1CNT0_SIZE                             0x1
#define _I2C1CNTL_I2C1CNT0_LENGTH                           0x1
#define _I2C1CNTL_I2C1CNT0_MASK                             0x1
#define _I2C1CNTL_I2C1CNT1_POSN                             0x1
#define _I2C1CNTL_I2C1CNT1_POSITION                         0x1
#define _I2C1CNTL_I2C1CNT1_SIZE                             0x1
#define _I2C1CNTL_I2C1CNT1_LENGTH                           0x1
#define _I2C1CNTL_I2C1CNT1_MASK                             0x2
#define _I2C1CNTL_I2C1CNT2_POSN                             0x2
#define _I2C1CNTL_I2C1CNT2_POSITION                         0x2
#define _I2C1CNTL_I2C1CNT2_SIZE                             0x1
#define _I2C1CNTL_I2C1CNT2_LENGTH                           0x1
#define _I2C1CNTL_I2C1CNT2_MASK                             0x4
#define _I2C1CNTL_I2C1CNT3_POSN                             0x3
#define _I2C1CNTL_I2C1CNT3_POSITION                         0x3
#define _I2C1CNTL_I2C1CNT3_SIZE                             0x1
#define _I2C1CNTL_I2C1CNT3_LENGTH                           0x1
#define _I2C1CNTL_I2C1CNT3_MASK                             0x8
#define _I2C1CNTL_I2C1CNT4_POSN                             0x4
#define _I2C1CNTL_I2C1CNT4_POSITION                         0x4
#define _I2C1CNTL_I2C1CNT4_SIZE                             0x1
#define _I2C1CNTL_I2C1CNT4_LENGTH                           0x1
#define _I2C1CNTL_I2C1CNT4_MASK                             0x10
#define _I2C1CNTL_I2C1CNT5_POSN                             0x5
#define _I2C1CNTL_I2C1CNT5_POSITION                         0x5
#define _I2C1CNTL_I2C1CNT5_SIZE                             0x1
#define _I2C1CNTL_I2C1CNT5_LENGTH                           0x1
#define _I2C1CNTL_I2C1CNT5_MASK                             0x20
#define _I2C1CNTL_I2C1CNT6_POSN                             0x6
#define _I2C1CNTL_I2C1CNT6_POSITION                         0x6
#define _I2C1CNTL_I2C1CNT6_SIZE                             0x1
#define _I2C1CNTL_I2C1CNT6_LENGTH                           0x1
#define _I2C1CNTL_I2C1CNT6_MASK                             0x40
#define _I2C1CNTL_I2C1CNT7_POSN                             0x7
#define _I2C1CNTL_I2C1CNT7_POSITION                         0x7
#define _I2C1CNTL_I2C1CNT7_SIZE                             0x1
#define _I2C1CNTL_I2C1CNT7_LENGTH                           0x1
#define _I2C1CNTL_I2C1CNT7_MASK                             0x80

// Register: I2C1CNTH
#define I2C1CNTH I2C1CNTH
extern volatile unsigned char           I2C1CNTH            __at(0x28C);
#ifndef _LIB_BUILD
asm("I2C1CNTH equ 028Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CNT                    :8;
    };
    struct {
        unsigned CNT8                   :1;
        unsigned CNT9                   :1;
        unsigned CNT10                  :1;
        unsigned CNT11                  :1;
        unsigned CNT12                  :1;
        unsigned CNT13                  :1;
        unsigned CNT14                  :1;
        unsigned CNT15                  :1;
    };
    struct {
        unsigned I2C1CNT                :8;
    };
    struct {
        unsigned I2C1CNT8               :1;
        unsigned I2C1CNT9               :1;
        unsigned I2C1CNT10              :1;
        unsigned I2C1CNT11              :1;
        unsigned I2C1CNT12              :1;
        unsigned I2C1CNT13              :1;
        unsigned I2C1CNT14              :1;
        unsigned I2C1CNT15              :1;
    };
} I2C1CNTHbits_t;
extern volatile I2C1CNTHbits_t I2C1CNTHbits __at(0x28C);
// bitfield macros
#define _I2C1CNTH_CNT_POSN                                  0x0
#define _I2C1CNTH_CNT_POSITION                              0x0
#define _I2C1CNTH_CNT_SIZE                                  0x8
#define _I2C1CNTH_CNT_LENGTH                                0x8
#define _I2C1CNTH_CNT_MASK                                  0xFF
#define _I2C1CNTH_CNT8_POSN                                 0x0
#define _I2C1CNTH_CNT8_POSITION                             0x0
#define _I2C1CNTH_CNT8_SIZE                                 0x1
#define _I2C1CNTH_CNT8_LENGTH                               0x1
#define _I2C1CNTH_CNT8_MASK                                 0x1
#define _I2C1CNTH_CNT9_POSN                                 0x1
#define _I2C1CNTH_CNT9_POSITION                             0x1
#define _I2C1CNTH_CNT9_SIZE                                 0x1
#define _I2C1CNTH_CNT9_LENGTH                               0x1
#define _I2C1CNTH_CNT9_MASK                                 0x2
#define _I2C1CNTH_CNT10_POSN                                0x2
#define _I2C1CNTH_CNT10_POSITION                            0x2
#define _I2C1CNTH_CNT10_SIZE                                0x1
#define _I2C1CNTH_CNT10_LENGTH                              0x1
#define _I2C1CNTH_CNT10_MASK                                0x4
#define _I2C1CNTH_CNT11_POSN                                0x3
#define _I2C1CNTH_CNT11_POSITION                            0x3
#define _I2C1CNTH_CNT11_SIZE                                0x1
#define _I2C1CNTH_CNT11_LENGTH                              0x1
#define _I2C1CNTH_CNT11_MASK                                0x8
#define _I2C1CNTH_CNT12_POSN                                0x4
#define _I2C1CNTH_CNT12_POSITION                            0x4
#define _I2C1CNTH_CNT12_SIZE                                0x1
#define _I2C1CNTH_CNT12_LENGTH                              0x1
#define _I2C1CNTH_CNT12_MASK                                0x10
#define _I2C1CNTH_CNT13_POSN                                0x5
#define _I2C1CNTH_CNT13_POSITION                            0x5
#define _I2C1CNTH_CNT13_SIZE                                0x1
#define _I2C1CNTH_CNT13_LENGTH                              0x1
#define _I2C1CNTH_CNT13_MASK                                0x20
#define _I2C1CNTH_CNT14_POSN                                0x6
#define _I2C1CNTH_CNT14_POSITION                            0x6
#define _I2C1CNTH_CNT14_SIZE                                0x1
#define _I2C1CNTH_CNT14_LENGTH                              0x1
#define _I2C1CNTH_CNT14_MASK                                0x40
#define _I2C1CNTH_CNT15_POSN                                0x7
#define _I2C1CNTH_CNT15_POSITION                            0x7
#define _I2C1CNTH_CNT15_SIZE                                0x1
#define _I2C1CNTH_CNT15_LENGTH                              0x1
#define _I2C1CNTH_CNT15_MASK                                0x80
#define _I2C1CNTH_I2C1CNT_POSN                              0x0
#define _I2C1CNTH_I2C1CNT_POSITION                          0x0
#define _I2C1CNTH_I2C1CNT_SIZE                              0x8
#define _I2C1CNTH_I2C1CNT_LENGTH                            0x8
#define _I2C1CNTH_I2C1CNT_MASK                              0xFF
#define _I2C1CNTH_I2C1CNT8_POSN                             0x0
#define _I2C1CNTH_I2C1CNT8_POSITION                         0x0
#define _I2C1CNTH_I2C1CNT8_SIZE                             0x1
#define _I2C1CNTH_I2C1CNT8_LENGTH                           0x1
#define _I2C1CNTH_I2C1CNT8_MASK                             0x1
#define _I2C1CNTH_I2C1CNT9_POSN                             0x1
#define _I2C1CNTH_I2C1CNT9_POSITION                         0x1
#define _I2C1CNTH_I2C1CNT9_SIZE                             0x1
#define _I2C1CNTH_I2C1CNT9_LENGTH                           0x1
#define _I2C1CNTH_I2C1CNT9_MASK                             0x2
#define _I2C1CNTH_I2C1CNT10_POSN                            0x2
#define _I2C1CNTH_I2C1CNT10_POSITION                        0x2
#define _I2C1CNTH_I2C1CNT10_SIZE                            0x1
#define _I2C1CNTH_I2C1CNT10_LENGTH                          0x1
#define _I2C1CNTH_I2C1CNT10_MASK                            0x4
#define _I2C1CNTH_I2C1CNT11_POSN                            0x3
#define _I2C1CNTH_I2C1CNT11_POSITION                        0x3
#define _I2C1CNTH_I2C1CNT11_SIZE                            0x1
#define _I2C1CNTH_I2C1CNT11_LENGTH                          0x1
#define _I2C1CNTH_I2C1CNT11_MASK                            0x8
#define _I2C1CNTH_I2C1CNT12_POSN                            0x4
#define _I2C1CNTH_I2C1CNT12_POSITION                        0x4
#define _I2C1CNTH_I2C1CNT12_SIZE                            0x1
#define _I2C1CNTH_I2C1CNT12_LENGTH                          0x1
#define _I2C1CNTH_I2C1CNT12_MASK                            0x10
#define _I2C1CNTH_I2C1CNT13_POSN                            0x5
#define _I2C1CNTH_I2C1CNT13_POSITION                        0x5
#define _I2C1CNTH_I2C1CNT13_SIZE                            0x1
#define _I2C1CNTH_I2C1CNT13_LENGTH                          0x1
#define _I2C1CNTH_I2C1CNT13_MASK                            0x20
#define _I2C1CNTH_I2C1CNT14_POSN                            0x6
#define _I2C1CNTH_I2C1CNT14_POSITION                        0x6
#define _I2C1CNTH_I2C1CNT14_SIZE                            0x1
#define _I2C1CNTH_I2C1CNT14_LENGTH                          0x1
#define _I2C1CNTH_I2C1CNT14_MASK                            0x40
#define _I2C1CNTH_I2C1CNT15_POSN                            0x7
#define _I2C1CNTH_I2C1CNT15_POSITION                        0x7
#define _I2C1CNTH_I2C1CNT15_SIZE                            0x1
#define _I2C1CNTH_I2C1CNT15_LENGTH                          0x1
#define _I2C1CNTH_I2C1CNT15_MASK                            0x80

// Register: I2C1ADB0
#define I2C1ADB0 I2C1ADB0
extern volatile unsigned char           I2C1ADB0            __at(0x28D);
#ifndef _LIB_BUILD
asm("I2C1ADB0 equ 028Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADB                    :8;
    };
} I2C1ADB0bits_t;
extern volatile I2C1ADB0bits_t I2C1ADB0bits __at(0x28D);
// bitfield macros
#define _I2C1ADB0_ADB_POSN                                  0x0
#define _I2C1ADB0_ADB_POSITION                              0x0
#define _I2C1ADB0_ADB_SIZE                                  0x8
#define _I2C1ADB0_ADB_LENGTH                                0x8
#define _I2C1ADB0_ADB_MASK                                  0xFF

