garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f55q71.h
extern volatile TU16ACON0bits_t TU16ACON0bits __at(0x3A0);
// bitfield macros
#define _TU16ACON0_CIE_POSN                                 0x0
#define _TU16ACON0_CIE_POSITION                             0x0
#define _TU16ACON0_CIE_SIZE                                 0x1
#define _TU16ACON0_CIE_LENGTH                               0x1
#define _TU16ACON0_CIE_MASK                                 0x1
#define _TU16ACON0_ZIE_POSN                                 0x1
#define _TU16ACON0_ZIE_POSITION                             0x1
#define _TU16ACON0_ZIE_SIZE                                 0x1
#define _TU16ACON0_ZIE_LENGTH                               0x1
#define _TU16ACON0_ZIE_MASK                                 0x2
#define _TU16ACON0_PRIE_POSN                                0x2
#define _TU16ACON0_PRIE_POSITION                            0x2
#define _TU16ACON0_PRIE_SIZE                                0x1
#define _TU16ACON0_PRIE_LENGTH                              0x1
#define _TU16ACON0_PRIE_MASK                                0x4
#define _TU16ACON0_RDSEL_POSN                               0x3
#define _TU16ACON0_RDSEL_POSITION                           0x3
#define _TU16ACON0_RDSEL_SIZE                               0x1
#define _TU16ACON0_RDSEL_LENGTH                             0x1
#define _TU16ACON0_RDSEL_MASK                               0x8
#define _TU16ACON0_OPOL_POSN                                0x4
#define _TU16ACON0_OPOL_POSITION                            0x4
#define _TU16ACON0_OPOL_SIZE                                0x1
#define _TU16ACON0_OPOL_LENGTH                              0x1
#define _TU16ACON0_OPOL_MASK                                0x10
#define _TU16ACON0_OM_POSN                                  0x5
#define _TU16ACON0_OM_POSITION                              0x5
#define _TU16ACON0_OM_SIZE                                  0x1
#define _TU16ACON0_OM_LENGTH                                0x1
#define _TU16ACON0_OM_MASK                                  0x20
#define _TU16ACON0_CPOL_POSN                                0x6
#define _TU16ACON0_CPOL_POSITION                            0x6
#define _TU16ACON0_CPOL_SIZE                                0x1
#define _TU16ACON0_CPOL_LENGTH                              0x1
#define _TU16ACON0_CPOL_MASK                                0x40
#define _TU16ACON0_ON_POSN                                  0x7
#define _TU16ACON0_ON_POSITION                              0x7
#define _TU16ACON0_ON_SIZE                                  0x1
#define _TU16ACON0_ON_LENGTH                                0x1
#define _TU16ACON0_ON_MASK                                  0x80
#define _TU16ACON0_TU16ACIE_POSN                            0x0
#define _TU16ACON0_TU16ACIE_POSITION                        0x0
#define _TU16ACON0_TU16ACIE_SIZE                            0x1
#define _TU16ACON0_TU16ACIE_LENGTH                          0x1
#define _TU16ACON0_TU16ACIE_MASK                            0x1
#define _TU16ACON0_TU16AZIE_POSN                            0x1
#define _TU16ACON0_TU16AZIE_POSITION                        0x1
#define _TU16ACON0_TU16AZIE_SIZE                            0x1
#define _TU16ACON0_TU16AZIE_LENGTH                          0x1
#define _TU16ACON0_TU16AZIE_MASK                            0x2
#define _TU16ACON0_TU16APRIE_POSN                           0x2
#define _TU16ACON0_TU16APRIE_POSITION                       0x2
#define _TU16ACON0_TU16APRIE_SIZE                           0x1
#define _TU16ACON0_TU16APRIE_LENGTH                         0x1
#define _TU16ACON0_TU16APRIE_MASK                           0x4
#define _TU16ACON0_TU16ARDSEL_POSN                          0x3
#define _TU16ACON0_TU16ARDSEL_POSITION                      0x3
#define _TU16ACON0_TU16ARDSEL_SIZE                          0x1
#define _TU16ACON0_TU16ARDSEL_LENGTH                        0x1
#define _TU16ACON0_TU16ARDSEL_MASK                          0x8
#define _TU16ACON0_TU16AOPOL_POSN                           0x4
#define _TU16ACON0_TU16AOPOL_POSITION                       0x4
#define _TU16ACON0_TU16AOPOL_SIZE                           0x1
#define _TU16ACON0_TU16AOPOL_LENGTH                         0x1
#define _TU16ACON0_TU16AOPOL_MASK                           0x10
#define _TU16ACON0_TU16AOM_POSN                             0x5
#define _TU16ACON0_TU16AOM_POSITION                         0x5
#define _TU16ACON0_TU16AOM_SIZE                             0x1
#define _TU16ACON0_TU16AOM_LENGTH                           0x1
#define _TU16ACON0_TU16AOM_MASK                             0x20
#define _TU16ACON0_TU16ACPOL_POSN                           0x6
#define _TU16ACON0_TU16ACPOL_POSITION                       0x6
#define _TU16ACON0_TU16ACPOL_SIZE                           0x1
#define _TU16ACON0_TU16ACPOL_LENGTH                         0x1
#define _TU16ACON0_TU16ACPOL_MASK                           0x40
#define _TU16ACON0_TU16AON_POSN                             0x7
#define _TU16ACON0_TU16AON_POSITION                         0x7
#define _TU16ACON0_TU16AON_SIZE                             0x1
#define _TU16ACON0_TU16AON_LENGTH                           0x1
#define _TU16ACON0_TU16AON_MASK                             0x80

// Register: TU16ACON1
#define TU16ACON1 TU16ACON1
extern volatile unsigned char           TU16ACON1           __at(0x3A1);
#ifndef _LIB_BUILD
asm("TU16ACON1 equ 03A1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CIF                    :1;
        unsigned ZIF                    :1;
        unsigned PRIF                   :1;
        unsigned CAPT                   :1;
        unsigned LIMIT                  :1;
        unsigned CLR                    :1;
        unsigned OSEN                   :1;
        unsigned RUN                    :1;
    };
    struct {
        unsigned TU16ACIF               :1;
        unsigned TU16AZIF               :1;
        unsigned TU16APRIF              :1;
        unsigned TU16ACAPT              :1;
        unsigned TU16ALIMIT             :1;
        unsigned TU16ACLR               :1;
        unsigned TMRAOSEN               :1;
        unsigned TU16ARUN               :1;
    };
} TU16ACON1bits_t;
