garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f55q71.h
extern volatile TU16BCRHbits_t TU16BCRHbits __at(0x3AF);
// bitfield macros
#define _TU16BCRH_CRH_POSN                                  0x0
#define _TU16BCRH_CRH_POSITION                              0x0
#define _TU16BCRH_CRH_SIZE                                  0x8
#define _TU16BCRH_CRH_LENGTH                                0x8
#define _TU16BCRH_CRH_MASK                                  0xFF
#define _TU16BCRH_CRH0_POSN                                 0x0
#define _TU16BCRH_CRH0_POSITION                             0x0
#define _TU16BCRH_CRH0_SIZE                                 0x1
#define _TU16BCRH_CRH0_LENGTH                               0x1
#define _TU16BCRH_CRH0_MASK                                 0x1
#define _TU16BCRH_CRH1_POSN                                 0x1
#define _TU16BCRH_CRH1_POSITION                             0x1
#define _TU16BCRH_CRH1_SIZE                                 0x1
#define _TU16BCRH_CRH1_LENGTH                               0x1
#define _TU16BCRH_CRH1_MASK                                 0x2
#define _TU16BCRH_CRH2_POSN                                 0x2
#define _TU16BCRH_CRH2_POSITION                             0x2
#define _TU16BCRH_CRH2_SIZE                                 0x1
#define _TU16BCRH_CRH2_LENGTH                               0x1
#define _TU16BCRH_CRH2_MASK                                 0x4
#define _TU16BCRH_CRH3_POSN                                 0x3
#define _TU16BCRH_CRH3_POSITION                             0x3
#define _TU16BCRH_CRH3_SIZE                                 0x1
#define _TU16BCRH_CRH3_LENGTH                               0x1
#define _TU16BCRH_CRH3_MASK                                 0x8
#define _TU16BCRH_CRH4_POSN                                 0x4
#define _TU16BCRH_CRH4_POSITION                             0x4
#define _TU16BCRH_CRH4_SIZE                                 0x1
#define _TU16BCRH_CRH4_LENGTH                               0x1
#define _TU16BCRH_CRH4_MASK                                 0x10
#define _TU16BCRH_CRH5_POSN                                 0x5
#define _TU16BCRH_CRH5_POSITION                             0x5
#define _TU16BCRH_CRH5_SIZE                                 0x1
#define _TU16BCRH_CRH5_LENGTH                               0x1
#define _TU16BCRH_CRH5_MASK                                 0x20
#define _TU16BCRH_CRH6_POSN                                 0x6
#define _TU16BCRH_CRH6_POSITION                             0x6
#define _TU16BCRH_CRH6_SIZE                                 0x1
#define _TU16BCRH_CRH6_LENGTH                               0x1
#define _TU16BCRH_CRH6_MASK                                 0x40
#define _TU16BCRH_CRH7_POSN                                 0x7
#define _TU16BCRH_CRH7_POSITION                             0x7
#define _TU16BCRH_CRH7_SIZE                                 0x1
#define _TU16BCRH_CRH7_LENGTH                               0x1
#define _TU16BCRH_CRH7_MASK                                 0x80
#define _TU16BCRH_TU16BCRH0_POSN                            0x0
#define _TU16BCRH_TU16BCRH0_POSITION                        0x0
#define _TU16BCRH_TU16BCRH0_SIZE                            0x1
#define _TU16BCRH_TU16BCRH0_LENGTH                          0x1
#define _TU16BCRH_TU16BCRH0_MASK                            0x1
#define _TU16BCRH_TU16BCRH1_POSN                            0x1
#define _TU16BCRH_TU16BCRH1_POSITION                        0x1
#define _TU16BCRH_TU16BCRH1_SIZE                            0x1
#define _TU16BCRH_TU16BCRH1_LENGTH                          0x1
#define _TU16BCRH_TU16BCRH1_MASK                            0x2
#define _TU16BCRH_TU16BCRH2_POSN                            0x2
#define _TU16BCRH_TU16BCRH2_POSITION                        0x2
#define _TU16BCRH_TU16BCRH2_SIZE                            0x1
#define _TU16BCRH_TU16BCRH2_LENGTH                          0x1
#define _TU16BCRH_TU16BCRH2_MASK                            0x4
#define _TU16BCRH_TU16BCRH3_POSN                            0x3
#define _TU16BCRH_TU16BCRH3_POSITION                        0x3
#define _TU16BCRH_TU16BCRH3_SIZE                            0x1
#define _TU16BCRH_TU16BCRH3_LENGTH                          0x1
#define _TU16BCRH_TU16BCRH3_MASK                            0x8
#define _TU16BCRH_TU16BCRH4_POSN                            0x4
#define _TU16BCRH_TU16BCRH4_POSITION                        0x4
#define _TU16BCRH_TU16BCRH4_SIZE                            0x1
#define _TU16BCRH_TU16BCRH4_LENGTH                          0x1
#define _TU16BCRH_TU16BCRH4_MASK                            0x10
#define _TU16BCRH_TU16BCRH5_POSN                            0x5
#define _TU16BCRH_TU16BCRH5_POSITION                        0x5
#define _TU16BCRH_TU16BCRH5_SIZE                            0x1
#define _TU16BCRH_TU16BCRH5_LENGTH                          0x1
#define _TU16BCRH_TU16BCRH5_MASK                            0x20
#define _TU16BCRH_TU16BCRH6_POSN                            0x6
#define _TU16BCRH_TU16BCRH6_POSITION                        0x6
#define _TU16BCRH_TU16BCRH6_SIZE                            0x1
#define _TU16BCRH_TU16BCRH6_LENGTH                          0x1
#define _TU16BCRH_TU16BCRH6_MASK                            0x40
#define _TU16BCRH_TU16BCRH7_POSN                            0x7
#define _TU16BCRH_TU16BCRH7_POSITION                        0x7
#define _TU16BCRH_TU16BCRH7_SIZE                            0x1
#define _TU16BCRH_TU16BCRH7_LENGTH                          0x1
#define _TU16BCRH_TU16BCRH7_MASK                            0x80
#define _TU16BCRH_TU16BCR8_POSN                             0x0
#define _TU16BCRH_TU16BCR8_POSITION                         0x0
#define _TU16BCRH_TU16BCR8_SIZE                             0x1
#define _TU16BCRH_TU16BCR8_LENGTH                           0x1
#define _TU16BCRH_TU16BCR8_MASK                             0x1
#define _TU16BCRH_TU16BCR9_POSN                             0x1
#define _TU16BCRH_TU16BCR9_POSITION                         0x1
#define _TU16BCRH_TU16BCR9_SIZE                             0x1
#define _TU16BCRH_TU16BCR9_LENGTH                           0x1
#define _TU16BCRH_TU16BCR9_MASK                             0x2
#define _TU16BCRH_TU16BCR10_POSN                            0x2
#define _TU16BCRH_TU16BCR10_POSITION                        0x2
#define _TU16BCRH_TU16BCR10_SIZE                            0x1
#define _TU16BCRH_TU16BCR10_LENGTH                          0x1
#define _TU16BCRH_TU16BCR10_MASK                            0x4
#define _TU16BCRH_TU16BCR11_POSN                            0x3
#define _TU16BCRH_TU16BCR11_POSITION                        0x3
#define _TU16BCRH_TU16BCR11_SIZE                            0x1
#define _TU16BCRH_TU16BCR11_LENGTH                          0x1
#define _TU16BCRH_TU16BCR11_MASK                            0x8
#define _TU16BCRH_TU16BCR12_POSN                            0x4
#define _TU16BCRH_TU16BCR12_POSITION                        0x4
#define _TU16BCRH_TU16BCR12_SIZE                            0x1
#define _TU16BCRH_TU16BCR12_LENGTH                          0x1
#define _TU16BCRH_TU16BCR12_MASK                            0x10
#define _TU16BCRH_TU16BCR13_POSN                            0x5
#define _TU16BCRH_TU16BCR13_POSITION                        0x5
#define _TU16BCRH_TU16BCR13_SIZE                            0x1
#define _TU16BCRH_TU16BCR13_LENGTH                          0x1
#define _TU16BCRH_TU16BCR13_MASK                            0x20
#define _TU16BCRH_TU16BCR14_POSN                            0x6
#define _TU16BCRH_TU16BCR14_POSITION                        0x6
#define _TU16BCRH_TU16BCR14_SIZE                            0x1
#define _TU16BCRH_TU16BCR14_LENGTH                          0x1
#define _TU16BCRH_TU16BCR14_MASK                            0x40
#define _TU16BCRH_TU16BCR15_POSN                            0x7
#define _TU16BCRH_TU16BCR15_POSITION                        0x7
#define _TU16BCRH_TU16BCR15_SIZE                            0x1
#define _TU16BCRH_TU16BCR15_LENGTH                          0x1
#define _TU16BCRH_TU16BCR15_MASK                            0x80

// Register: TU16BPR
#define TU16BPR TU16BPR
extern volatile unsigned short          TU16BPR             __at(0x3B0);
#ifndef _LIB_BUILD
asm("TU16BPR equ 03B0h");
#endif

// Register: TU16BPRL
#define TU16BPRL TU16BPRL
extern volatile unsigned char           TU16BPRL            __at(0x3B0);
#ifndef _LIB_BUILD
asm("TU16BPRL equ 03B0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRL                    :8;
    };
    struct {
        unsigned PRL0                   :1;
        unsigned PRL1                   :1;
        unsigned PRL2                   :1;
        unsigned PRL3                   :1;
        unsigned PRL4                   :1;
        unsigned PRL5                   :1;
        unsigned PRL6                   :1;
        unsigned PRL7                   :1;
    };
    struct {
        unsigned TU16BPRL0              :1;
        unsigned TU16BPRL1              :1;
        unsigned TU16BPRL2              :1;
        unsigned TU16BPRL3              :1;
        unsigned TU16BPRL4              :1;
        unsigned TU16BPRL5              :1;
        unsigned TU16BPRL6              :1;
        unsigned TU16BPRL7              :1;
    };
    struct {
        unsigned TU16BPR0               :1;
        unsigned TU16BPR1               :1;
        unsigned TU16BPR2               :1;
        unsigned TU16BPR3               :1;
        unsigned TU16BPR4               :1;
        unsigned TU16BPR5               :1;
        unsigned TU16BPR6               :1;
        unsigned TU16BPR7               :1;
    };
} TU16BPRLbits_t;
