garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f55q71.h
extern volatile PIR1bits_t PIR1bits __at(0x4B3);
// bitfield macros
#define _PIR1_INT0IF_POSN                                   0x0
#define _PIR1_INT0IF_POSITION                               0x0
#define _PIR1_INT0IF_SIZE                                   0x1
#define _PIR1_INT0IF_LENGTH                                 0x1
#define _PIR1_INT0IF_MASK                                   0x1
#define _PIR1_ADCH1IF_POSN                                  0x1
#define _PIR1_ADCH1IF_POSITION                              0x1
#define _PIR1_ADCH1IF_SIZE                                  0x1
#define _PIR1_ADCH1IF_LENGTH                                0x1
#define _PIR1_ADCH1IF_MASK                                  0x2
#define _PIR1_ADIF_POSN                                     0x2
#define _PIR1_ADIF_POSITION                                 0x2
#define _PIR1_ADIF_SIZE                                     0x1
#define _PIR1_ADIF_LENGTH                                   0x1
#define _PIR1_ADIF_MASK                                     0x4
#define _PIR1_ACTIF_POSN                                    0x3
#define _PIR1_ACTIF_POSITION                                0x3
#define _PIR1_ACTIF_SIZE                                    0x1
#define _PIR1_ACTIF_LENGTH                                  0x1
#define _PIR1_ACTIF_MASK                                    0x8
#define _PIR1_C1IF_POSN                                     0x4
#define _PIR1_C1IF_POSITION                                 0x4
#define _PIR1_C1IF_SIZE                                     0x1
#define _PIR1_C1IF_LENGTH                                   0x1
#define _PIR1_C1IF_MASK                                     0x10
#define _PIR1_ADCH2IF_POSN                                  0x5
#define _PIR1_ADCH2IF_POSITION                              0x5
#define _PIR1_ADCH2IF_SIZE                                  0x1
#define _PIR1_ADCH2IF_LENGTH                                0x1
#define _PIR1_ADCH2IF_MASK                                  0x20
#define _PIR1_ADCH3IF_POSN                                  0x6
#define _PIR1_ADCH3IF_POSITION                              0x6
#define _PIR1_ADCH3IF_SIZE                                  0x1
#define _PIR1_ADCH3IF_LENGTH                                0x1
#define _PIR1_ADCH3IF_MASK                                  0x40
#define _PIR1_ADCH4IF_POSN                                  0x7
#define _PIR1_ADCH4IF_POSITION                              0x7
#define _PIR1_ADCH4IF_SIZE                                  0x1
#define _PIR1_ADCH4IF_LENGTH                                0x1
#define _PIR1_ADCH4IF_MASK                                  0x80

// Register: PIR2
#define PIR2 PIR2
extern volatile unsigned char           PIR2                __at(0x4B4);
#ifndef _LIB_BUILD
asm("PIR2 equ 04B4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ZCDIF                  :1;
        unsigned CLC5IF                 :1;
        unsigned IOCSRIF                :1;
        unsigned                        :1;
        unsigned DMA1SCNTIF             :1;
        unsigned DMA1DCNTIF             :1;
        unsigned DMA1ORIF               :1;
        unsigned DMA1AIF                :1;
    };
} PIR2bits_t;
extern volatile PIR2bits_t PIR2bits __at(0x4B4);
// bitfield macros
#define _PIR2_ZCDIF_POSN                                    0x0
#define _PIR2_ZCDIF_POSITION                                0x0
#define _PIR2_ZCDIF_SIZE                                    0x1
#define _PIR2_ZCDIF_LENGTH                                  0x1
#define _PIR2_ZCDIF_MASK                                    0x1
#define _PIR2_CLC5IF_POSN                                   0x1
#define _PIR2_CLC5IF_POSITION                               0x1
#define _PIR2_CLC5IF_SIZE                                   0x1
#define _PIR2_CLC5IF_LENGTH                                 0x1
#define _PIR2_CLC5IF_MASK                                   0x2
#define _PIR2_IOCSRIF_POSN                                  0x2
#define _PIR2_IOCSRIF_POSITION                              0x2
#define _PIR2_IOCSRIF_SIZE                                  0x1
#define _PIR2_IOCSRIF_LENGTH                                0x1
#define _PIR2_IOCSRIF_MASK                                  0x4
#define _PIR2_DMA1SCNTIF_POSN                               0x4
#define _PIR2_DMA1SCNTIF_POSITION                           0x4
#define _PIR2_DMA1SCNTIF_SIZE                               0x1
#define _PIR2_DMA1SCNTIF_LENGTH                             0x1
#define _PIR2_DMA1SCNTIF_MASK                               0x10
#define _PIR2_DMA1DCNTIF_POSN                               0x5
#define _PIR2_DMA1DCNTIF_POSITION                           0x5
#define _PIR2_DMA1DCNTIF_SIZE                               0x1
#define _PIR2_DMA1DCNTIF_LENGTH                             0x1
#define _PIR2_DMA1DCNTIF_MASK                               0x20
#define _PIR2_DMA1ORIF_POSN                                 0x6
#define _PIR2_DMA1ORIF_POSITION                             0x6
#define _PIR2_DMA1ORIF_SIZE                                 0x1
#define _PIR2_DMA1ORIF_LENGTH                               0x1
#define _PIR2_DMA1ORIF_MASK                                 0x40
#define _PIR2_DMA1AIF_POSN                                  0x7
#define _PIR2_DMA1AIF_POSITION                              0x7
#define _PIR2_DMA1AIF_SIZE                                  0x1
#define _PIR2_DMA1AIF_LENGTH                                0x1
#define _PIR2_DMA1AIF_MASK                                  0x80

// Register: PIR3
#define PIR3 PIR3
extern volatile unsigned char           PIR3                __at(0x4B5);
#ifndef _LIB_BUILD
asm("PIR3 equ 04B5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPI1RXIF               :1;
        unsigned SPI1TXIF               :1;
        unsigned SPI1IF                 :1;
        unsigned TMR2IF                 :1;
        unsigned TMR1IF                 :1;
        unsigned TMR1GIF                :1;
        unsigned CCP1IF                 :1;
        unsigned TMR0IF                 :1;
    };
} PIR3bits_t;
extern volatile PIR3bits_t PIR3bits __at(0x4B5);
// bitfield macros
#define _PIR3_SPI1RXIF_POSN                                 0x0
#define _PIR3_SPI1RXIF_POSITION                             0x0
#define _PIR3_SPI1RXIF_SIZE                                 0x1
#define _PIR3_SPI1RXIF_LENGTH                               0x1
#define _PIR3_SPI1RXIF_MASK                                 0x1
#define _PIR3_SPI1TXIF_POSN                                 0x1
#define _PIR3_SPI1TXIF_POSITION                             0x1
#define _PIR3_SPI1TXIF_SIZE                                 0x1
#define _PIR3_SPI1TXIF_LENGTH                               0x1
#define _PIR3_SPI1TXIF_MASK                                 0x2
#define _PIR3_SPI1IF_POSN                                   0x2
#define _PIR3_SPI1IF_POSITION                               0x2
#define _PIR3_SPI1IF_SIZE                                   0x1
#define _PIR3_SPI1IF_LENGTH                                 0x1
#define _PIR3_SPI1IF_MASK                                   0x4
#define _PIR3_TMR2IF_POSN                                   0x3
#define _PIR3_TMR2IF_POSITION                               0x3
#define _PIR3_TMR2IF_SIZE                                   0x1
#define _PIR3_TMR2IF_LENGTH                                 0x1
#define _PIR3_TMR2IF_MASK                                   0x8
#define _PIR3_TMR1IF_POSN                                   0x4
#define _PIR3_TMR1IF_POSITION                               0x4
#define _PIR3_TMR1IF_SIZE                                   0x1
#define _PIR3_TMR1IF_LENGTH                                 0x1
#define _PIR3_TMR1IF_MASK                                   0x10
#define _PIR3_TMR1GIF_POSN                                  0x5
#define _PIR3_TMR1GIF_POSITION                              0x5
#define _PIR3_TMR1GIF_SIZE                                  0x1
#define _PIR3_TMR1GIF_LENGTH                                0x1
#define _PIR3_TMR1GIF_MASK                                  0x20
#define _PIR3_CCP1IF_POSN                                   0x6
#define _PIR3_CCP1IF_POSITION                               0x6
#define _PIR3_CCP1IF_SIZE                                   0x1
#define _PIR3_CCP1IF_LENGTH                                 0x1
#define _PIR3_CCP1IF_MASK                                   0x40
#define _PIR3_TMR0IF_POSN                                   0x7
#define _PIR3_TMR0IF_POSITION                               0x7
#define _PIR3_TMR0IF_SIZE                                   0x1
#define _PIR3_TMR0IF_LENGTH                                 0x1
#define _PIR3_TMR0IF_MASK                                   0x80

// Register: PIR4
#define PIR4 PIR4
extern volatile unsigned char           PIR4                __at(0x4B6);
#ifndef _LIB_BUILD
asm("PIR4 equ 04B6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U1RXIF                 :1;
        unsigned U1TXIF                 :1;
        unsigned U1EIF                  :1;
        unsigned U1IF                   :1;
        unsigned TMR3IF                 :1;
        unsigned TMR3GIF                :1;
        unsigned PWM1PIF                :1;
        unsigned PWM1IF                 :1;
    };
} PIR4bits_t;
extern volatile PIR4bits_t PIR4bits __at(0x4B6);
// bitfield macros
#define _PIR4_U1RXIF_POSN                                   0x0
#define _PIR4_U1RXIF_POSITION                               0x0
#define _PIR4_U1RXIF_SIZE                                   0x1
#define _PIR4_U1RXIF_LENGTH                                 0x1
#define _PIR4_U1RXIF_MASK                                   0x1
#define _PIR4_U1TXIF_POSN                                   0x1
#define _PIR4_U1TXIF_POSITION                               0x1
#define _PIR4_U1TXIF_SIZE                                   0x1
#define _PIR4_U1TXIF_LENGTH                                 0x1
#define _PIR4_U1TXIF_MASK                                   0x2
#define _PIR4_U1EIF_POSN                                    0x2
#define _PIR4_U1EIF_POSITION                                0x2
#define _PIR4_U1EIF_SIZE                                    0x1
#define _PIR4_U1EIF_LENGTH                                  0x1
#define _PIR4_U1EIF_MASK                                    0x4
#define _PIR4_U1IF_POSN                                     0x3
#define _PIR4_U1IF_POSITION                                 0x3
#define _PIR4_U1IF_SIZE                                     0x1
#define _PIR4_U1IF_LENGTH                                   0x1
#define _PIR4_U1IF_MASK                                     0x8
#define _PIR4_TMR3IF_POSN                                   0x4
#define _PIR4_TMR3IF_POSITION                               0x4
#define _PIR4_TMR3IF_SIZE                                   0x1
#define _PIR4_TMR3IF_LENGTH                                 0x1
#define _PIR4_TMR3IF_MASK                                   0x10
#define _PIR4_TMR3GIF_POSN                                  0x5
#define _PIR4_TMR3GIF_POSITION                              0x5
#define _PIR4_TMR3GIF_SIZE                                  0x1
#define _PIR4_TMR3GIF_LENGTH                                0x1
#define _PIR4_TMR3GIF_MASK                                  0x20
#define _PIR4_PWM1PIF_POSN                                  0x6
#define _PIR4_PWM1PIF_POSITION                              0x6
#define _PIR4_PWM1PIF_SIZE                                  0x1
#define _PIR4_PWM1PIF_LENGTH                                0x1
#define _PIR4_PWM1PIF_MASK                                  0x40
#define _PIR4_PWM1IF_POSN                                   0x7
#define _PIR4_PWM1IF_POSITION                               0x7
#define _PIR4_PWM1IF_SIZE                                   0x1
#define _PIR4_PWM1IF_LENGTH                                 0x1
#define _PIR4_PWM1IF_MASK                                   0x80

