garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f55q71.h
#define                                 HADR11_bit          _BIT_ACCESS(SCANHADRH,3)
// SCANHADRH<HADR12>
extern volatile __bit                   HADR12              __at(0x1AF4);	// @ (0x35E * 8 + 4)
#define                                 HADR12_bit          _BIT_ACCESS(SCANHADRH,4)
// SCANHADRH<HADR13>
extern volatile __bit                   HADR13              __at(0x1AF5);	// @ (0x35E * 8 + 5)
#define                                 HADR13_bit          _BIT_ACCESS(SCANHADRH,5)
// SCANHADRH<HADR14>
extern volatile __bit                   HADR14              __at(0x1AF6);	// @ (0x35E * 8 + 6)
#define                                 HADR14_bit          _BIT_ACCESS(SCANHADRH,6)
// SCANHADRH<HADR15>
extern volatile __bit                   HADR15              __at(0x1AF7);	// @ (0x35E * 8 + 7)
#define                                 HADR15_bit          _BIT_ACCESS(SCANHADRH,7)
// SCANHADRU<HADR16>
extern volatile __bit                   HADR16              __at(0x1AF8);	// @ (0x35F * 8 + 0)
#define                                 HADR16_bit          _BIT_ACCESS(SCANHADRU,0)
// SCANHADRU<HADR17>
extern volatile __bit                   HADR17              __at(0x1AF9);	// @ (0x35F * 8 + 1)
#define                                 HADR17_bit          _BIT_ACCESS(SCANHADRU,1)
// SCANHADRU<HADR18>
extern volatile __bit                   HADR18              __at(0x1AFA);	// @ (0x35F * 8 + 2)
#define                                 HADR18_bit          _BIT_ACCESS(SCANHADRU,2)
// SCANHADRU<HADR19>
extern volatile __bit                   HADR19              __at(0x1AFB);	// @ (0x35F * 8 + 3)
#define                                 HADR19_bit          _BIT_ACCESS(SCANHADRU,3)
// SCANHADRL<HADR2>
extern volatile __bit                   HADR2               __at(0x1AEA);	// @ (0x35D * 8 + 2)
#define                                 HADR2_bit           _BIT_ACCESS(SCANHADRL,2)
// SCANHADRU<HADR20>
extern volatile __bit                   HADR20              __at(0x1AFC);	// @ (0x35F * 8 + 4)
#define                                 HADR20_bit          _BIT_ACCESS(SCANHADRU,4)
// SCANHADRU<HADR21>
extern volatile __bit                   HADR21              __at(0x1AFD);	// @ (0x35F * 8 + 5)
#define                                 HADR21_bit          _BIT_ACCESS(SCANHADRU,5)
// SCANHADRL<HADR3>
extern volatile __bit                   HADR3               __at(0x1AEB);	// @ (0x35D * 8 + 3)
#define                                 HADR3_bit           _BIT_ACCESS(SCANHADRL,3)
// SCANHADRL<HADR4>
extern volatile __bit                   HADR4               __at(0x1AEC);	// @ (0x35D * 8 + 4)
#define                                 HADR4_bit           _BIT_ACCESS(SCANHADRL,4)
// SCANHADRL<HADR5>
extern volatile __bit                   HADR5               __at(0x1AED);	// @ (0x35D * 8 + 5)
#define                                 HADR5_bit           _BIT_ACCESS(SCANHADRL,5)
// SCANHADRL<HADR6>
extern volatile __bit                   HADR6               __at(0x1AEE);	// @ (0x35D * 8 + 6)
#define                                 HADR6_bit           _BIT_ACCESS(SCANHADRL,6)
// SCANHADRL<HADR7>
extern volatile __bit                   HADR7               __at(0x1AEF);	// @ (0x35D * 8 + 7)
#define                                 HADR7_bit           _BIT_ACCESS(SCANHADRL,7)
// SCANHADRH<HADR8>
extern volatile __bit                   HADR8               __at(0x1AF0);	// @ (0x35E * 8 + 0)
#define                                 HADR8_bit           _BIT_ACCESS(SCANHADRH,0)
// SCANHADRH<HADR9>
extern volatile __bit                   HADR9               __at(0x1AF1);	// @ (0x35E * 8 + 1)
#define                                 HADR9_bit           _BIT_ACCESS(SCANHADRH,1)
// OSCEN<HFOEN>
extern volatile __bit                   HFOEN               __at(0x59E);	// @ (0xB3 * 8 + 6)
#define                                 HFOEN_bit           _BIT_ACCESS(OSCEN,6)
// OSCSTAT<HFOR>
extern volatile __bit                   HFOR                __at(0x596);	// @ (0xB2 * 8 + 6)
#define                                 HFOR_bit            _BIT_ACCESS(OSCSTAT,6)
// HLVDCON0<HLVDEN>
extern volatile __bit                   HLVDEN              __at(0x257);	// @ (0x4A * 8 + 7)
#define                                 HLVDEN_bit          _BIT_ACCESS(HLVDCON0,7)
// PIE0<HLVDIE>
extern volatile __bit                   HLVDIE              __at(0x2539);	// @ (0x4A7 * 8 + 1)
#define                                 HLVDIE_bit          _BIT_ACCESS(PIE0,1)
// PIR0<HLVDIF>
extern volatile __bit                   HLVDIF              __at(0x2591);	// @ (0x4B2 * 8 + 1)
#define                                 HLVDIF_bit          _BIT_ACCESS(PIR0,1)
// HLVDCON0<HLVDINTH>
extern volatile __bit                   HLVDINTH            __at(0x251);	// @ (0x4A * 8 + 1)
#define                                 HLVDINTH_bit        _BIT_ACCESS(HLVDCON0,1)
// HLVDCON0<HLVDINTL>
extern volatile __bit                   HLVDINTL            __at(0x250);	// @ (0x4A * 8 + 0)
#define                                 HLVDINTL_bit        _BIT_ACCESS(HLVDCON0,0)
// IPR0<HLVDIP>
extern volatile __bit                   HLVDIP              __at(0x24E1);	// @ (0x49C * 8 + 1)
#define                                 HLVDIP_bit          _BIT_ACCESS(IPR0,1)
// PMD0<HLVDMD>
extern volatile __bit                   HLVDMD              __at(0x315);	// @ (0x62 * 8 + 5)
#define                                 HLVDMD_bit          _BIT_ACCESS(PMD0,5)
// HLVDCON0<HLVDOUT>
extern volatile __bit                   HLVDOUT             __at(0x255);	// @ (0x4A * 8 + 5)
#define                                 HLVDOUT_bit         _BIT_ACCESS(HLVDCON0,5)
// HLVDCON0<HLVDRDY>
extern volatile __bit                   HLVDRDY             __at(0x254);	// @ (0x4A * 8 + 4)
#define                                 HLVDRDY_bit         _BIT_ACCESS(HLVDCON0,4)
// HLVDCON1<HLVDSEL0>
extern volatile __bit                   HLVDSEL0            __at(0x258);	// @ (0x4B * 8 + 0)
#define                                 HLVDSEL0_bit        _BIT_ACCESS(HLVDCON1,0)
// HLVDCON1<HLVDSEL1>
extern volatile __bit                   HLVDSEL1            __at(0x259);	// @ (0x4B * 8 + 1)
#define                                 HLVDSEL1_bit        _BIT_ACCESS(HLVDCON1,1)
// HLVDCON1<HLVDSEL2>
extern volatile __bit                   HLVDSEL2            __at(0x25A);	// @ (0x4B * 8 + 2)
#define                                 HLVDSEL2_bit        _BIT_ACCESS(HLVDCON1,2)
// HLVDCON1<HLVDSEL3>
extern volatile __bit                   HLVDSEL3            __at(0x25B);	// @ (0x4B * 8 + 3)
#define                                 HLVDSEL3_bit        _BIT_ACCESS(HLVDCON1,3)
// I2C1CNTL<I2C1CNT0>
extern volatile __bit                   I2C1CNT0            __at(0x1458);	// @ (0x28B * 8 + 0)
#define                                 I2C1CNT0_bit        _BIT_ACCESS(I2C1CNTL,0)
// I2C1CNTL<I2C1CNT1>
extern volatile __bit                   I2C1CNT1            __at(0x1459);	// @ (0x28B * 8 + 1)
#define                                 I2C1CNT1_bit        _BIT_ACCESS(I2C1CNTL,1)
// I2C1CNTH<I2C1CNT10>
extern volatile __bit                   I2C1CNT10           __at(0x1462);	// @ (0x28C * 8 + 2)
#define                                 I2C1CNT10_bit       _BIT_ACCESS(I2C1CNTH,2)
// I2C1CNTH<I2C1CNT11>
extern volatile __bit                   I2C1CNT11           __at(0x1463);	// @ (0x28C * 8 + 3)
#define                                 I2C1CNT11_bit       _BIT_ACCESS(I2C1CNTH,3)
// I2C1CNTH<I2C1CNT12>
extern volatile __bit                   I2C1CNT12           __at(0x1464);	// @ (0x28C * 8 + 4)
#define                                 I2C1CNT12_bit       _BIT_ACCESS(I2C1CNTH,4)
// I2C1CNTH<I2C1CNT13>
extern volatile __bit                   I2C1CNT13           __at(0x1465);	// @ (0x28C * 8 + 5)
#define                                 I2C1CNT13_bit       _BIT_ACCESS(I2C1CNTH,5)
// I2C1CNTH<I2C1CNT14>
extern volatile __bit                   I2C1CNT14           __at(0x1466);	// @ (0x28C * 8 + 6)
#define                                 I2C1CNT14_bit       _BIT_ACCESS(I2C1CNTH,6)
// I2C1CNTH<I2C1CNT15>
extern volatile __bit                   I2C1CNT15           __at(0x1467);	// @ (0x28C * 8 + 7)
#define                                 I2C1CNT15_bit       _BIT_ACCESS(I2C1CNTH,7)
// I2C1CNTL<I2C1CNT2>
extern volatile __bit                   I2C1CNT2            __at(0x145A);	// @ (0x28B * 8 + 2)
#define                                 I2C1CNT2_bit        _BIT_ACCESS(I2C1CNTL,2)
// I2C1CNTL<I2C1CNT3>
extern volatile __bit                   I2C1CNT3            __at(0x145B);	// @ (0x28B * 8 + 3)
#define                                 I2C1CNT3_bit        _BIT_ACCESS(I2C1CNTL,3)
// I2C1CNTL<I2C1CNT4>
extern volatile __bit                   I2C1CNT4            __at(0x145C);	// @ (0x28B * 8 + 4)
#define                                 I2C1CNT4_bit        _BIT_ACCESS(I2C1CNTL,4)
// I2C1CNTL<I2C1CNT5>
extern volatile __bit                   I2C1CNT5            __at(0x145D);	// @ (0x28B * 8 + 5)
#define                                 I2C1CNT5_bit        _BIT_ACCESS(I2C1CNTL,5)
// I2C1CNTL<I2C1CNT6>
extern volatile __bit                   I2C1CNT6            __at(0x145E);	// @ (0x28B * 8 + 6)
#define                                 I2C1CNT6_bit        _BIT_ACCESS(I2C1CNTL,6)
// I2C1CNTL<I2C1CNT7>
extern volatile __bit                   I2C1CNT7            __at(0x145F);	// @ (0x28B * 8 + 7)
#define                                 I2C1CNT7_bit        _BIT_ACCESS(I2C1CNTL,7)
// I2C1CNTH<I2C1CNT8>
extern volatile __bit                   I2C1CNT8            __at(0x1460);	// @ (0x28C * 8 + 0)
#define                                 I2C1CNT8_bit        _BIT_ACCESS(I2C1CNTH,0)
// I2C1CNTH<I2C1CNT9>
extern volatile __bit                   I2C1CNT9            __at(0x1461);	// @ (0x28C * 8 + 1)
#define                                 I2C1CNT9_bit        _BIT_ACCESS(I2C1CNTH,1)
// PIE7<I2C1EIE>
extern volatile __bit                   I2C1EIE             __at(0x2573);	// @ (0x4AE * 8 + 3)
#define                                 I2C1EIE_bit         _BIT_ACCESS(PIE7,3)
// PIR7<I2C1EIF>
extern volatile __bit                   I2C1EIF             __at(0x25CB);	// @ (0x4B9 * 8 + 3)
#define                                 I2C1EIF_bit         _BIT_ACCESS(PIR7,3)
// IPR7<I2C1EIP>
extern volatile __bit                   I2C1EIP             __at(0x251B);	// @ (0x4A3 * 8 + 3)
#define                                 I2C1EIP_bit         _BIT_ACCESS(IPR7,3)
// PIE7<I2C1IE>
extern volatile __bit                   I2C1IE              __at(0x2572);	// @ (0x4AE * 8 + 2)
#define                                 I2C1IE_bit          _BIT_ACCESS(PIE7,2)
// PIR7<I2C1IF>
extern volatile __bit                   I2C1IF              __at(0x25CA);	// @ (0x4B9 * 8 + 2)
#define                                 I2C1IF_bit          _BIT_ACCESS(PIR7,2)
// IPR7<I2C1IP>
extern volatile __bit                   I2C1IP              __at(0x251A);	// @ (0x4A3 * 8 + 2)
#define                                 I2C1IP_bit          _BIT_ACCESS(IPR7,2)
// PMD3<I2C1MD>
extern volatile __bit                   I2C1MD              __at(0x32B);	// @ (0x65 * 8 + 3)
#define                                 I2C1MD_bit          _BIT_ACCESS(PMD3,3)
// PIE7<I2C1RXIE>
extern volatile __bit                   I2C1RXIE            __at(0x2570);	// @ (0x4AE * 8 + 0)
#define                                 I2C1RXIE_bit        _BIT_ACCESS(PIE7,0)
// PIR7<I2C1RXIF>
extern volatile __bit                   I2C1RXIF            __at(0x25C8);	// @ (0x4B9 * 8 + 0)
#define                                 I2C1RXIF_bit        _BIT_ACCESS(PIR7,0)
// IPR7<I2C1RXIP>
extern volatile __bit                   I2C1RXIP            __at(0x2518);	// @ (0x4A3 * 8 + 0)
#define                                 I2C1RXIP_bit        _BIT_ACCESS(IPR7,0)
// I2C1SCLPPS<I2C1SCLPPS0>
extern volatile __bit                   I2C1SCLPPS0         __at(0x1388);	// @ (0x271 * 8 + 0)
#define                                 I2C1SCLPPS0_bit     _BIT_ACCESS(I2C1SCLPPS,0)
// I2C1SCLPPS<I2C1SCLPPS1>
extern volatile __bit                   I2C1SCLPPS1         __at(0x1389);	// @ (0x271 * 8 + 1)
#define                                 I2C1SCLPPS1_bit     _BIT_ACCESS(I2C1SCLPPS,1)
// I2C1SCLPPS<I2C1SCLPPS2>
extern volatile __bit                   I2C1SCLPPS2         __at(0x138A);	// @ (0x271 * 8 + 2)
#define                                 I2C1SCLPPS2_bit     _BIT_ACCESS(I2C1SCLPPS,2)
// I2C1SCLPPS<I2C1SCLPPS3>
extern volatile __bit                   I2C1SCLPPS3         __at(0x138B);	// @ (0x271 * 8 + 3)
#define                                 I2C1SCLPPS3_bit     _BIT_ACCESS(I2C1SCLPPS,3)
// I2C1SCLPPS<I2C1SCLPPS4>
extern volatile __bit                   I2C1SCLPPS4         __at(0x138C);	// @ (0x271 * 8 + 4)
#define                                 I2C1SCLPPS4_bit     _BIT_ACCESS(I2C1SCLPPS,4)
// I2C1SCLPPS<I2C1SCLPPS5>
extern volatile __bit                   I2C1SCLPPS5         __at(0x138D);	// @ (0x271 * 8 + 5)
#define                                 I2C1SCLPPS5_bit     _BIT_ACCESS(I2C1SCLPPS,5)
// I2C1SDAPPS<I2C1SDAPPS0>
extern volatile __bit                   I2C1SDAPPS0         __at(0x1380);	// @ (0x270 * 8 + 0)
#define                                 I2C1SDAPPS0_bit     _BIT_ACCESS(I2C1SDAPPS,0)
// I2C1SDAPPS<I2C1SDAPPS1>
extern volatile __bit                   I2C1SDAPPS1         __at(0x1381);	// @ (0x270 * 8 + 1)
#define                                 I2C1SDAPPS1_bit     _BIT_ACCESS(I2C1SDAPPS,1)
// I2C1SDAPPS<I2C1SDAPPS2>
extern volatile __bit                   I2C1SDAPPS2         __at(0x1382);	// @ (0x270 * 8 + 2)
#define                                 I2C1SDAPPS2_bit     _BIT_ACCESS(I2C1SDAPPS,2)
// I2C1SDAPPS<I2C1SDAPPS3>
extern volatile __bit                   I2C1SDAPPS3         __at(0x1383);	// @ (0x270 * 8 + 3)
#define                                 I2C1SDAPPS3_bit     _BIT_ACCESS(I2C1SDAPPS,3)
// I2C1SDAPPS<I2C1SDAPPS4>
extern volatile __bit                   I2C1SDAPPS4         __at(0x1384);	// @ (0x270 * 8 + 4)
#define                                 I2C1SDAPPS4_bit     _BIT_ACCESS(I2C1SDAPPS,4)
// I2C1SDAPPS<I2C1SDAPPS5>
extern volatile __bit                   I2C1SDAPPS5         __at(0x1385);	// @ (0x270 * 8 + 5)
#define                                 I2C1SDAPPS5_bit     _BIT_ACCESS(I2C1SDAPPS,5)
// PIE7<I2C1TXIE>
extern volatile __bit                   I2C1TXIE            __at(0x2571);	// @ (0x4AE * 8 + 1)
#define                                 I2C1TXIE_bit        _BIT_ACCESS(PIE7,1)
// PIR7<I2C1TXIF>
extern volatile __bit                   I2C1TXIF            __at(0x25C9);	// @ (0x4B9 * 8 + 1)
#define                                 I2C1TXIF_bit        _BIT_ACCESS(PIR7,1)
// IPR7<I2C1TXIP>
extern volatile __bit                   I2C1TXIP            __at(0x2519);	// @ (0x4A3 * 8 + 1)
#define                                 I2C1TXIP_bit        _BIT_ACCESS(IPR7,1)
// I2C1BTOC<I2CBTOC0>
extern volatile __bit                   I2CBTOC0            __at(0x14F8);	// @ (0x29F * 8 + 0)
#define                                 I2CBTOC0_bit        _BIT_ACCESS(I2C1BTOC,0)
// I2C1BTOC<I2CBTOC1>
extern volatile __bit                   I2CBTOC1            __at(0x14F9);	// @ (0x29F * 8 + 1)
#define                                 I2CBTOC1_bit        _BIT_ACCESS(I2C1BTOC,1)
// I2C1BTOC<I2CBTOC2>
extern volatile __bit                   I2CBTOC2            __at(0x14FA);	// @ (0x29F * 8 + 2)
#define                                 I2CBTOC2_bit        _BIT_ACCESS(I2C1BTOC,2)
// I2C1BTOC<I2CBTOC3>
extern volatile __bit                   I2CBTOC3            __at(0x14FB);	// @ (0x29F * 8 + 3)
#define                                 I2CBTOC3_bit        _BIT_ACCESS(I2C1BTOC,3)
// I2C1CLK<I2CCLK0>
extern volatile __bit                   I2CCLK0             __at(0x14F0);	// @ (0x29E * 8 + 0)
#define                                 I2CCLK0_bit         _BIT_ACCESS(I2C1CLK,0)
// I2C1CLK<I2CCLK1>
extern volatile __bit                   I2CCLK1             __at(0x14F1);	// @ (0x29E * 8 + 1)
#define                                 I2CCLK1_bit         _BIT_ACCESS(I2C1CLK,1)
// I2C1CLK<I2CCLK2>
extern volatile __bit                   I2CCLK2             __at(0x14F2);	// @ (0x29E * 8 + 2)
#define                                 I2CCLK2_bit         _BIT_ACCESS(I2C1CLK,2)
// I2C1CLK<I2CCLK3>
extern volatile __bit                   I2CCLK3             __at(0x14F3);	// @ (0x29E * 8 + 3)
#define                                 I2CCLK3_bit         _BIT_ACCESS(I2C1CLK,3)
// I2C1CLK<I2CCLK4>
extern volatile __bit                   I2CCLK4             __at(0x14F4);	// @ (0x29E * 8 + 4)
#define                                 I2CCLK4_bit         _BIT_ACCESS(I2C1CLK,4)
// I2C1CON0<I2CEN>
extern volatile __bit                   I2CEN               __at(0x149F);	// @ (0x293 * 8 + 7)
#define                                 I2CEN_bit           _BIT_ACCESS(I2C1CON0,7)
// ADCON0<IC>
extern volatile __bit                   IC                  __at(0x1F99);	// @ (0x3F3 * 8 + 1)
#define                                 IC_bit              _BIT_ACCESS(ADCON0,1)
// CPUDOZE<IDLEN>
extern volatile __bit                   IDLEN               __at(0x2797);	// @ (0x4F2 * 8 + 7)
#define                                 IDLEN_bit           _BIT_ACCESS(CPUDOZE,7)
// CWG1CON1<IN>
extern volatile __bit                   IN                  __at(0x1E0D);	// @ (0x3C1 * 8 + 5)
#define                                 IN_bit              _BIT_ACCESS(CWG1CON1,5)
// NCO1INCL<INC0>
extern volatile __bit                   INC0                __at(0x2218);	// @ (0x443 * 8 + 0)
#define                                 INC0_bit            _BIT_ACCESS(NCO1INCL,0)
// NCO1INCL<INC1>
extern volatile __bit                   INC1                __at(0x2219);	// @ (0x443 * 8 + 1)
#define                                 INC1_bit            _BIT_ACCESS(NCO1INCL,1)
// NCO1INCH<INC10>
extern volatile __bit                   INC10               __at(0x2222);	// @ (0x444 * 8 + 2)
#define                                 INC10_bit           _BIT_ACCESS(NCO1INCH,2)
// NCO1INCH<INC11>
extern volatile __bit                   INC11               __at(0x2223);	// @ (0x444 * 8 + 3)
#define                                 INC11_bit           _BIT_ACCESS(NCO1INCH,3)
// NCO1INCH<INC12>
extern volatile __bit                   INC12               __at(0x2224);	// @ (0x444 * 8 + 4)
#define                                 INC12_bit           _BIT_ACCESS(NCO1INCH,4)
// NCO1INCH<INC13>
extern volatile __bit                   INC13               __at(0x2225);	// @ (0x444 * 8 + 5)
#define                                 INC13_bit           _BIT_ACCESS(NCO1INCH,5)
// NCO1INCH<INC14>
extern volatile __bit                   INC14               __at(0x2226);	// @ (0x444 * 8 + 6)
#define                                 INC14_bit           _BIT_ACCESS(NCO1INCH,6)
// NCO1INCH<INC15>
extern volatile __bit                   INC15               __at(0x2227);	// @ (0x444 * 8 + 7)
#define                                 INC15_bit           _BIT_ACCESS(NCO1INCH,7)
// NCO1INCU<INC16>
extern volatile __bit                   INC16               __at(0x2228);	// @ (0x445 * 8 + 0)
#define                                 INC16_bit           _BIT_ACCESS(NCO1INCU,0)
// NCO1INCU<INC17>
extern volatile __bit                   INC17               __at(0x2229);	// @ (0x445 * 8 + 1)
#define                                 INC17_bit           _BIT_ACCESS(NCO1INCU,1)
// NCO1INCU<INC18>
extern volatile __bit                   INC18               __at(0x222A);	// @ (0x445 * 8 + 2)
#define                                 INC18_bit           _BIT_ACCESS(NCO1INCU,2)
// NCO1INCU<INC19>
extern volatile __bit                   INC19               __at(0x222B);	// @ (0x445 * 8 + 3)
#define                                 INC19_bit           _BIT_ACCESS(NCO1INCU,3)
// NCO1INCL<INC2>
extern volatile __bit                   INC2                __at(0x221A);	// @ (0x443 * 8 + 2)
#define                                 INC2_bit            _BIT_ACCESS(NCO1INCL,2)
// NCO1INCL<INC3>
extern volatile __bit                   INC3                __at(0x221B);	// @ (0x443 * 8 + 3)
#define                                 INC3_bit            _BIT_ACCESS(NCO1INCL,3)
// NCO1INCL<INC4>
extern volatile __bit                   INC4                __at(0x221C);	// @ (0x443 * 8 + 4)
#define                                 INC4_bit            _BIT_ACCESS(NCO1INCL,4)
// NCO1INCL<INC5>
extern volatile __bit                   INC5                __at(0x221D);	// @ (0x443 * 8 + 5)
#define                                 INC5_bit            _BIT_ACCESS(NCO1INCL,5)
// NCO1INCL<INC6>
extern volatile __bit                   INC6                __at(0x221E);	// @ (0x443 * 8 + 6)
#define                                 INC6_bit            _BIT_ACCESS(NCO1INCL,6)
// NCO1INCL<INC7>
extern volatile __bit                   INC7                __at(0x221F);	// @ (0x443 * 8 + 7)
#define                                 INC7_bit            _BIT_ACCESS(NCO1INCL,7)
// NCO1INCH<INC8>
extern volatile __bit                   INC8                __at(0x2220);	// @ (0x444 * 8 + 0)
#define                                 INC8_bit            _BIT_ACCESS(NCO1INCH,0)
// NCO1INCH<INC9>
extern volatile __bit                   INC9                __at(0x2221);	// @ (0x444 * 8 + 1)
#define                                 INC9_bit            _BIT_ACCESS(NCO1INCH,1)
// INLVLA<INLVLA0>
extern volatile __bit                   INLVLA0             __at(0x2020);	// @ (0x404 * 8 + 0)
#define                                 INLVLA0_bit         _BIT_ACCESS(INLVLA,0)
// INLVLA<INLVLA1>
extern volatile __bit                   INLVLA1             __at(0x2021);	// @ (0x404 * 8 + 1)
#define                                 INLVLA1_bit         _BIT_ACCESS(INLVLA,1)
// INLVLA<INLVLA2>
extern volatile __bit                   INLVLA2             __at(0x2022);	// @ (0x404 * 8 + 2)
#define                                 INLVLA2_bit         _BIT_ACCESS(INLVLA,2)
// INLVLA<INLVLA3>
extern volatile __bit                   INLVLA3             __at(0x2023);	// @ (0x404 * 8 + 3)
#define                                 INLVLA3_bit         _BIT_ACCESS(INLVLA,3)
// INLVLA<INLVLA4>
extern volatile __bit                   INLVLA4             __at(0x2024);	// @ (0x404 * 8 + 4)
#define                                 INLVLA4_bit         _BIT_ACCESS(INLVLA,4)
// INLVLA<INLVLA5>
extern volatile __bit                   INLVLA5             __at(0x2025);	// @ (0x404 * 8 + 5)
#define                                 INLVLA5_bit         _BIT_ACCESS(INLVLA,5)
// INLVLA<INLVLA6>
extern volatile __bit                   INLVLA6             __at(0x2026);	// @ (0x404 * 8 + 6)
#define                                 INLVLA6_bit         _BIT_ACCESS(INLVLA,6)
// INLVLA<INLVLA7>
extern volatile __bit                   INLVLA7             __at(0x2027);	// @ (0x404 * 8 + 7)
#define                                 INLVLA7_bit         _BIT_ACCESS(INLVLA,7)
// INLVLB<INLVLB0>
extern volatile __bit                   INLVLB0             __at(0x2060);	// @ (0x40C * 8 + 0)
#define                                 INLVLB0_bit         _BIT_ACCESS(INLVLB,0)
// INLVLB<INLVLB1>
extern volatile __bit                   INLVLB1             __at(0x2061);	// @ (0x40C * 8 + 1)
#define                                 INLVLB1_bit         _BIT_ACCESS(INLVLB,1)
// INLVLB<INLVLB2>
extern volatile __bit                   INLVLB2             __at(0x2062);	// @ (0x40C * 8 + 2)
#define                                 INLVLB2_bit         _BIT_ACCESS(INLVLB,2)
// INLVLB<INLVLB3>
extern volatile __bit                   INLVLB3             __at(0x2063);	// @ (0x40C * 8 + 3)
#define                                 INLVLB3_bit         _BIT_ACCESS(INLVLB,3)
// INLVLB<INLVLB4>
extern volatile __bit                   INLVLB4             __at(0x2064);	// @ (0x40C * 8 + 4)
#define                                 INLVLB4_bit         _BIT_ACCESS(INLVLB,4)
// INLVLB<INLVLB5>
