garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f55q71.h
extern volatile __bit                   IOCCN4              __at(0x20B4);	// @ (0x416 * 8 + 4)
#define                                 IOCCN4_bit          _BIT_ACCESS(IOCCN,4)
// IOCCN<IOCCN5>
extern volatile __bit                   IOCCN5              __at(0x20B5);	// @ (0x416 * 8 + 5)
#define                                 IOCCN5_bit          _BIT_ACCESS(IOCCN,5)
// IOCCN<IOCCN6>
extern volatile __bit                   IOCCN6              __at(0x20B6);	// @ (0x416 * 8 + 6)
#define                                 IOCCN6_bit          _BIT_ACCESS(IOCCN,6)
// IOCCN<IOCCN7>
extern volatile __bit                   IOCCN7              __at(0x20B7);	// @ (0x416 * 8 + 7)
#define                                 IOCCN7_bit          _BIT_ACCESS(IOCCN,7)
// IOCCP<IOCCP0>
extern volatile __bit                   IOCCP0              __at(0x20A8);	// @ (0x415 * 8 + 0)
#define                                 IOCCP0_bit          _BIT_ACCESS(IOCCP,0)
// IOCCP<IOCCP1>
extern volatile __bit                   IOCCP1              __at(0x20A9);	// @ (0x415 * 8 + 1)
#define                                 IOCCP1_bit          _BIT_ACCESS(IOCCP,1)
// IOCCP<IOCCP2>
extern volatile __bit                   IOCCP2              __at(0x20AA);	// @ (0x415 * 8 + 2)
#define                                 IOCCP2_bit          _BIT_ACCESS(IOCCP,2)
// IOCCP<IOCCP3>
extern volatile __bit                   IOCCP3              __at(0x20AB);	// @ (0x415 * 8 + 3)
#define                                 IOCCP3_bit          _BIT_ACCESS(IOCCP,3)
// IOCCP<IOCCP4>
extern volatile __bit                   IOCCP4              __at(0x20AC);	// @ (0x415 * 8 + 4)
#define                                 IOCCP4_bit          _BIT_ACCESS(IOCCP,4)
// IOCCP<IOCCP5>
extern volatile __bit                   IOCCP5              __at(0x20AD);	// @ (0x415 * 8 + 5)
#define                                 IOCCP5_bit          _BIT_ACCESS(IOCCP,5)
// IOCCP<IOCCP6>
extern volatile __bit                   IOCCP6              __at(0x20AE);	// @ (0x415 * 8 + 6)
#define                                 IOCCP6_bit          _BIT_ACCESS(IOCCP,6)
// IOCCP<IOCCP7>
extern volatile __bit                   IOCCP7              __at(0x20AF);	// @ (0x415 * 8 + 7)
#define                                 IOCCP7_bit          _BIT_ACCESS(IOCCP,7)
// IOCEF<IOCEF3>
extern volatile __bit                   IOCEF3              __at(0x213B);	// @ (0x427 * 8 + 3)
#define                                 IOCEF3_bit          _BIT_ACCESS(IOCEF,3)
// IOCEN<IOCEN3>
extern volatile __bit                   IOCEN3              __at(0x2133);	// @ (0x426 * 8 + 3)
#define                                 IOCEN3_bit          _BIT_ACCESS(IOCEN,3)
// IOCEP<IOCEP3>
extern volatile __bit                   IOCEP3              __at(0x212B);	// @ (0x425 * 8 + 3)
#define                                 IOCEP3_bit          _BIT_ACCESS(IOCEP,3)
// PIE0<IOCIE>
extern volatile __bit                   IOCIE               __at(0x253F);	// @ (0x4A7 * 8 + 7)
#define                                 IOCIE_bit           _BIT_ACCESS(PIE0,7)
// PIR0<IOCIF>
extern volatile __bit                   IOCIF               __at(0x2597);	// @ (0x4B2 * 8 + 7)
#define                                 IOCIF_bit           _BIT_ACCESS(PIR0,7)
// IPR0<IOCIP>
extern volatile __bit                   IOCIP               __at(0x24E7);	// @ (0x49C * 8 + 7)
#define                                 IOCIP_bit           _BIT_ACCESS(IPR0,7)
// PMD0<IOCMD>
extern volatile __bit                   IOCMD               __at(0x310);	// @ (0x62 * 8 + 0)
#define                                 IOCMD_bit           _BIT_ACCESS(PMD0,0)
// PIE2<IOCSRIE>
extern volatile __bit                   IOCSRIE             __at(0x254A);	// @ (0x4A9 * 8 + 2)
#define                                 IOCSRIE_bit         _BIT_ACCESS(PIE2,2)
// PIR2<IOCSRIF>
extern volatile __bit                   IOCSRIF             __at(0x25A2);	// @ (0x4B4 * 8 + 2)
#define                                 IOCSRIF_bit         _BIT_ACCESS(PIR2,2)
// IPR2<IOCSRIP>
extern volatile __bit                   IOCSRIP             __at(0x24F2);	// @ (0x49E * 8 + 2)
#define                                 IOCSRIP_bit         _BIT_ACCESS(IPR2,2)
// IOCWF<IOCWF0>
extern volatile __bit                   IOCWF0              __at(0x21F8);	// @ (0x43F * 8 + 0)
#define                                 IOCWF0_bit          _BIT_ACCESS(IOCWF,0)
// IOCWF<IOCWF1>
extern volatile __bit                   IOCWF1              __at(0x21F9);	// @ (0x43F * 8 + 1)
#define                                 IOCWF1_bit          _BIT_ACCESS(IOCWF,1)
// IOCWF<IOCWF2>
extern volatile __bit                   IOCWF2              __at(0x21FA);	// @ (0x43F * 8 + 2)
#define                                 IOCWF2_bit          _BIT_ACCESS(IOCWF,2)
// IOCWF<IOCWF3>
extern volatile __bit                   IOCWF3              __at(0x21FB);	// @ (0x43F * 8 + 3)
#define                                 IOCWF3_bit          _BIT_ACCESS(IOCWF,3)
// IOCWF<IOCWF4>
extern volatile __bit                   IOCWF4              __at(0x21FC);	// @ (0x43F * 8 + 4)
#define                                 IOCWF4_bit          _BIT_ACCESS(IOCWF,4)
// IOCWF<IOCWF5>
extern volatile __bit                   IOCWF5              __at(0x21FD);	// @ (0x43F * 8 + 5)
#define                                 IOCWF5_bit          _BIT_ACCESS(IOCWF,5)
// IOCWF<IOCWF6>
extern volatile __bit                   IOCWF6              __at(0x21FE);	// @ (0x43F * 8 + 6)
#define                                 IOCWF6_bit          _BIT_ACCESS(IOCWF,6)
// IOCWF<IOCWF7>
extern volatile __bit                   IOCWF7              __at(0x21FF);	// @ (0x43F * 8 + 7)
#define                                 IOCWF7_bit          _BIT_ACCESS(IOCWF,7)
// IOCWN<IOCWN0>
extern volatile __bit                   IOCWN0              __at(0x21F0);	// @ (0x43E * 8 + 0)
#define                                 IOCWN0_bit          _BIT_ACCESS(IOCWN,0)
// IOCWN<IOCWN1>
extern volatile __bit                   IOCWN1              __at(0x21F1);	// @ (0x43E * 8 + 1)
#define                                 IOCWN1_bit          _BIT_ACCESS(IOCWN,1)
// IOCWN<IOCWN2>
extern volatile __bit                   IOCWN2              __at(0x21F2);	// @ (0x43E * 8 + 2)
#define                                 IOCWN2_bit          _BIT_ACCESS(IOCWN,2)
// IOCWN<IOCWN3>
extern volatile __bit                   IOCWN3              __at(0x21F3);	// @ (0x43E * 8 + 3)
#define                                 IOCWN3_bit          _BIT_ACCESS(IOCWN,3)
// IOCWN<IOCWN4>
extern volatile __bit                   IOCWN4              __at(0x21F4);	// @ (0x43E * 8 + 4)
#define                                 IOCWN4_bit          _BIT_ACCESS(IOCWN,4)
// IOCWN<IOCWN5>
extern volatile __bit                   IOCWN5              __at(0x21F5);	// @ (0x43E * 8 + 5)
#define                                 IOCWN5_bit          _BIT_ACCESS(IOCWN,5)
// IOCWN<IOCWN6>
extern volatile __bit                   IOCWN6              __at(0x21F6);	// @ (0x43E * 8 + 6)
#define                                 IOCWN6_bit          _BIT_ACCESS(IOCWN,6)
// IOCWN<IOCWN7>
extern volatile __bit                   IOCWN7              __at(0x21F7);	// @ (0x43E * 8 + 7)
#define                                 IOCWN7_bit          _BIT_ACCESS(IOCWN,7)
// IOCWP<IOCWP0>
extern volatile __bit                   IOCWP0              __at(0x21E8);	// @ (0x43D * 8 + 0)
#define                                 IOCWP0_bit          _BIT_ACCESS(IOCWP,0)
// IOCWP<IOCWP1>
extern volatile __bit                   IOCWP1              __at(0x21E9);	// @ (0x43D * 8 + 1)
#define                                 IOCWP1_bit          _BIT_ACCESS(IOCWP,1)
// IOCWP<IOCWP2>
extern volatile __bit                   IOCWP2              __at(0x21EA);	// @ (0x43D * 8 + 2)
#define                                 IOCWP2_bit          _BIT_ACCESS(IOCWP,2)
// IOCWP<IOCWP3>
extern volatile __bit                   IOCWP3              __at(0x21EB);	// @ (0x43D * 8 + 3)
#define                                 IOCWP3_bit          _BIT_ACCESS(IOCWP,3)
// IOCWP<IOCWP4>
extern volatile __bit                   IOCWP4              __at(0x21EC);	// @ (0x43D * 8 + 4)
#define                                 IOCWP4_bit          _BIT_ACCESS(IOCWP,4)
// IOCWP<IOCWP5>
extern volatile __bit                   IOCWP5              __at(0x21ED);	// @ (0x43D * 8 + 5)
#define                                 IOCWP5_bit          _BIT_ACCESS(IOCWP,5)
// IOCWP<IOCWP6>
extern volatile __bit                   IOCWP6              __at(0x21EE);	// @ (0x43D * 8 + 6)
#define                                 IOCWP6_bit          _BIT_ACCESS(IOCWP,6)
// IOCWP<IOCWP7>
extern volatile __bit                   IOCWP7              __at(0x21EF);	// @ (0x43D * 8 + 7)
#define                                 IOCWP7_bit          _BIT_ACCESS(IOCWP,7)
// CWG1ISM<ISM0>
extern volatile __bit                   ISM0                __at(0x1DE8);	// @ (0x3BD * 8 + 0)
#define                                 ISM0_bit            _BIT_ACCESS(CWG1ISM,0)
// CWG1ISM<ISM1>
extern volatile __bit                   ISM1                __at(0x1DE9);	// @ (0x3BD * 8 + 1)
#define                                 ISM1_bit            _BIT_ACCESS(CWG1ISM,1)
// CWG1ISM<ISM2>
extern volatile __bit                   ISM2                __at(0x1DEA);	// @ (0x3BD * 8 + 2)
#define                                 ISM2_bit            _BIT_ACCESS(CWG1ISM,2)
// CWG1ISM<ISM3>
extern volatile __bit                   ISM3                __at(0x1DEB);	// @ (0x3BD * 8 + 3)
#define                                 ISM3_bit            _BIT_ACCESS(CWG1ISM,3)
// CWG1ISM<ISM4>
extern volatile __bit                   ISM4                __at(0x1DEC);	// @ (0x3BD * 8 + 4)
#define                                 ISM4_bit            _BIT_ACCESS(CWG1ISM,4)
// ISRPR<ISRPR0>
extern volatile __bit                   ISRPR0              __at(0x5F8);	// @ (0xBF * 8 + 0)
#define                                 ISRPR0_bit          _BIT_ACCESS(ISRPR,0)
// ISRPR<ISRPR1>
extern volatile __bit                   ISRPR1              __at(0x5F9);	// @ (0xBF * 8 + 1)
#define                                 ISRPR1_bit          _BIT_ACCESS(ISRPR,1)
// ISRPR<ISRPR2>
extern volatile __bit                   ISRPR2              __at(0x5FA);	// @ (0xBF * 8 + 2)
#define                                 ISRPR2_bit          _BIT_ACCESS(ISRPR,2)
// IVTLOCK<IVTLOCKED>
extern volatile __bit                   IVTLOCKED           __at(0x22C8);	// @ (0x459 * 8 + 0)
#define                                 IVTLOCKED_bit       _BIT_ACCESS(IVTLOCK,0)
// SCANLADRL<LADR0>
extern volatile __bit                   LADR0               __at(0x1AD0);	// @ (0x35A * 8 + 0)
#define                                 LADR0_bit           _BIT_ACCESS(SCANLADRL,0)
// SCANLADRL<LADR1>
extern volatile __bit                   LADR1               __at(0x1AD1);	// @ (0x35A * 8 + 1)
#define                                 LADR1_bit           _BIT_ACCESS(SCANLADRL,1)
// SCANLADRH<LADR10>
extern volatile __bit                   LADR10              __at(0x1ADA);	// @ (0x35B * 8 + 2)
#define                                 LADR10_bit          _BIT_ACCESS(SCANLADRH,2)
// SCANLADRH<LADR11>
extern volatile __bit                   LADR11              __at(0x1ADB);	// @ (0x35B * 8 + 3)
#define                                 LADR11_bit          _BIT_ACCESS(SCANLADRH,3)
// SCANLADRH<LADR12>
extern volatile __bit                   LADR12              __at(0x1ADC);	// @ (0x35B * 8 + 4)
#define                                 LADR12_bit          _BIT_ACCESS(SCANLADRH,4)
// SCANLADRH<LADR13>
extern volatile __bit                   LADR13              __at(0x1ADD);	// @ (0x35B * 8 + 5)
#define                                 LADR13_bit          _BIT_ACCESS(SCANLADRH,5)
// SCANLADRH<LADR14>
extern volatile __bit                   LADR14              __at(0x1ADE);	// @ (0x35B * 8 + 6)
#define                                 LADR14_bit          _BIT_ACCESS(SCANLADRH,6)
// SCANLADRH<LADR15>
extern volatile __bit                   LADR15              __at(0x1ADF);	// @ (0x35B * 8 + 7)
#define                                 LADR15_bit          _BIT_ACCESS(SCANLADRH,7)
// SCANLADRU<LADR16>
extern volatile __bit                   LADR16              __at(0x1AE0);	// @ (0x35C * 8 + 0)
#define                                 LADR16_bit          _BIT_ACCESS(SCANLADRU,0)
// SCANLADRU<LADR17>
extern volatile __bit                   LADR17              __at(0x1AE1);	// @ (0x35C * 8 + 1)
#define                                 LADR17_bit          _BIT_ACCESS(SCANLADRU,1)
// SCANLADRU<LADR18>
extern volatile __bit                   LADR18              __at(0x1AE2);	// @ (0x35C * 8 + 2)
#define                                 LADR18_bit          _BIT_ACCESS(SCANLADRU,2)
// SCANLADRU<LADR19>
extern volatile __bit                   LADR19              __at(0x1AE3);	// @ (0x35C * 8 + 3)
#define                                 LADR19_bit          _BIT_ACCESS(SCANLADRU,3)
// SCANLADRL<LADR2>
extern volatile __bit                   LADR2               __at(0x1AD2);	// @ (0x35A * 8 + 2)
#define                                 LADR2_bit           _BIT_ACCESS(SCANLADRL,2)
// SCANLADRU<LADR20>
extern volatile __bit                   LADR20              __at(0x1AE4);	// @ (0x35C * 8 + 4)
#define                                 LADR20_bit          _BIT_ACCESS(SCANLADRU,4)
// SCANLADRU<LADR21>
extern volatile __bit                   LADR21              __at(0x1AE5);	// @ (0x35C * 8 + 5)
#define                                 LADR21_bit          _BIT_ACCESS(SCANLADRU,5)
// SCANLADRL<LADR3>
extern volatile __bit                   LADR3               __at(0x1AD3);	// @ (0x35A * 8 + 3)
#define                                 LADR3_bit           _BIT_ACCESS(SCANLADRL,3)
// SCANLADRL<LADR4>
extern volatile __bit                   LADR4               __at(0x1AD4);	// @ (0x35A * 8 + 4)
#define                                 LADR4_bit           _BIT_ACCESS(SCANLADRL,4)
// SCANLADRL<LADR5>
extern volatile __bit                   LADR5               __at(0x1AD5);	// @ (0x35A * 8 + 5)
#define                                 LADR5_bit           _BIT_ACCESS(SCANLADRL,5)
// SCANLADRL<LADR6>
extern volatile __bit                   LADR6               __at(0x1AD6);	// @ (0x35A * 8 + 6)
#define                                 LADR6_bit           _BIT_ACCESS(SCANLADRL,6)
// SCANLADRL<LADR7>
extern volatile __bit                   LADR7               __at(0x1AD7);	// @ (0x35A * 8 + 7)
#define                                 LADR7_bit           _BIT_ACCESS(SCANLADRL,7)
// SCANLADRH<LADR8>
extern volatile __bit                   LADR8               __at(0x1AD8);	// @ (0x35B * 8 + 0)
#define                                 LADR8_bit           _BIT_ACCESS(SCANLADRH,0)
// SCANLADRH<LADR9>
extern volatile __bit                   LADR9               __at(0x1AD9);	// @ (0x35B * 8 + 1)
#define                                 LADR9_bit           _BIT_ACCESS(SCANLADRH,1)
// LATA<LATA0>
extern volatile __bit                   LATA0               __at(0xA00);	// @ (0x140 * 8 + 0)
#define                                 LATA0_bit           _BIT_ACCESS(LATA,0)
// LATA<LATA1>
extern volatile __bit                   LATA1               __at(0xA01);	// @ (0x140 * 8 + 1)
#define                                 LATA1_bit           _BIT_ACCESS(LATA,1)
// LATA<LATA2>
extern volatile __bit                   LATA2               __at(0xA02);	// @ (0x140 * 8 + 2)
#define                                 LATA2_bit           _BIT_ACCESS(LATA,2)
// LATA<LATA3>
extern volatile __bit                   LATA3               __at(0xA03);	// @ (0x140 * 8 + 3)
#define                                 LATA3_bit           _BIT_ACCESS(LATA,3)
// LATA<LATA4>
extern volatile __bit                   LATA4               __at(0xA04);	// @ (0x140 * 8 + 4)
#define                                 LATA4_bit           _BIT_ACCESS(LATA,4)
// LATA<LATA5>
extern volatile __bit                   LATA5               __at(0xA05);	// @ (0x140 * 8 + 5)
#define                                 LATA5_bit           _BIT_ACCESS(LATA,5)
// LATA<LATA6>
extern volatile __bit                   LATA6               __at(0xA06);	// @ (0x140 * 8 + 6)
#define                                 LATA6_bit           _BIT_ACCESS(LATA,6)
// LATA<LATA7>
extern volatile __bit                   LATA7               __at(0xA07);	// @ (0x140 * 8 + 7)
#define                                 LATA7_bit           _BIT_ACCESS(LATA,7)
// LATB<LATB0>
extern volatile __bit                   LATB0               __at(0xA08);	// @ (0x141 * 8 + 0)
#define                                 LATB0_bit           _BIT_ACCESS(LATB,0)
// LATB<LATB1>
extern volatile __bit                   LATB1               __at(0xA09);	// @ (0x141 * 8 + 1)
#define                                 LATB1_bit           _BIT_ACCESS(LATB,1)
// LATB<LATB2>
extern volatile __bit                   LATB2               __at(0xA0A);	// @ (0x141 * 8 + 2)
#define                                 LATB2_bit           _BIT_ACCESS(LATB,2)
// LATB<LATB3>
extern volatile __bit                   LATB3               __at(0xA0B);	// @ (0x141 * 8 + 3)
#define                                 LATB3_bit           _BIT_ACCESS(LATB,3)
// LATB<LATB4>
extern volatile __bit                   LATB4               __at(0xA0C);	// @ (0x141 * 8 + 4)
#define                                 LATB4_bit           _BIT_ACCESS(LATB,4)
// LATB<LATB5>
extern volatile __bit                   LATB5               __at(0xA0D);	// @ (0x141 * 8 + 5)
#define                                 LATB5_bit           _BIT_ACCESS(LATB,5)
// LATB<LATB6>
extern volatile __bit                   LATB6               __at(0xA0E);	// @ (0x141 * 8 + 6)
#define                                 LATB6_bit           _BIT_ACCESS(LATB,6)
// LATB<LATB7>
extern volatile __bit                   LATB7               __at(0xA0F);	// @ (0x141 * 8 + 7)
#define                                 LATB7_bit           _BIT_ACCESS(LATB,7)
// LATC<LATC0>
extern volatile __bit                   LATC0               __at(0xA10);	// @ (0x142 * 8 + 0)
#define                                 LATC0_bit           _BIT_ACCESS(LATC,0)
// LATC<LATC1>
extern volatile __bit                   LATC1               __at(0xA11);	// @ (0x142 * 8 + 1)
#define                                 LATC1_bit           _BIT_ACCESS(LATC,1)
// LATC<LATC2>
extern volatile __bit                   LATC2               __at(0xA12);	// @ (0x142 * 8 + 2)
#define                                 LATC2_bit           _BIT_ACCESS(LATC,2)
// LATC<LATC3>
extern volatile __bit                   LATC3               __at(0xA13);	// @ (0x142 * 8 + 3)
#define                                 LATC3_bit           _BIT_ACCESS(LATC,3)
// LATC<LATC4>
extern volatile __bit                   LATC4               __at(0xA14);	// @ (0x142 * 8 + 4)
#define                                 LATC4_bit           _BIT_ACCESS(LATC,4)
// LATC<LATC5>
extern volatile __bit                   LATC5               __at(0xA15);	// @ (0x142 * 8 + 5)
#define                                 LATC5_bit           _BIT_ACCESS(LATC,5)
// LATC<LATC6>
extern volatile __bit                   LATC6               __at(0xA16);	// @ (0x142 * 8 + 6)
#define                                 LATC6_bit           _BIT_ACCESS(LATC,6)
// LATC<LATC7>
extern volatile __bit                   LATC7               __at(0xA17);	// @ (0x142 * 8 + 7)
#define                                 LATC7_bit           _BIT_ACCESS(LATC,7)
// LATD<LATD0>
extern volatile __bit                   LATD0               __at(0xA18);	// @ (0x143 * 8 + 0)
#define                                 LATD0_bit           _BIT_ACCESS(LATD,0)
// LATD<LATD1>
extern volatile __bit                   LATD1               __at(0xA19);	// @ (0x143 * 8 + 1)
#define                                 LATD1_bit           _BIT_ACCESS(LATD,1)
// LATD<LATD2>
extern volatile __bit                   LATD2               __at(0xA1A);	// @ (0x143 * 8 + 2)
#define                                 LATD2_bit           _BIT_ACCESS(LATD,2)
// LATD<LATD3>
extern volatile __bit                   LATD3               __at(0xA1B);	// @ (0x143 * 8 + 3)
#define                                 LATD3_bit           _BIT_ACCESS(LATD,3)
// LATD<LATD4>
extern volatile __bit                   LATD4               __at(0xA1C);	// @ (0x143 * 8 + 4)
#define                                 LATD4_bit           _BIT_ACCESS(LATD,4)
// LATD<LATD5>
extern volatile __bit                   LATD5               __at(0xA1D);	// @ (0x143 * 8 + 5)
#define                                 LATD5_bit           _BIT_ACCESS(LATD,5)
// LATD<LATD6>
extern volatile __bit                   LATD6               __at(0xA1E);	// @ (0x143 * 8 + 6)
#define                                 LATD6_bit           _BIT_ACCESS(LATD,6)
// LATD<LATD7>
extern volatile __bit                   LATD7               __at(0xA1F);	// @ (0x143 * 8 + 7)
#define                                 LATD7_bit           _BIT_ACCESS(LATD,7)
// LATE<LATE0>
extern volatile __bit                   LATE0               __at(0xA20);	// @ (0x144 * 8 + 0)
#define                                 LATE0_bit           _BIT_ACCESS(LATE,0)
// LATE<LATE1>
extern volatile __bit                   LATE1               __at(0xA21);	// @ (0x144 * 8 + 1)
#define                                 LATE1_bit           _BIT_ACCESS(LATE,1)
// LATE<LATE2>
extern volatile __bit                   LATE2               __at(0xA22);	// @ (0x144 * 8 + 2)
#define                                 LATE2_bit           _BIT_ACCESS(LATE,2)
// LATF<LATF0>
extern volatile __bit                   LATF0               __at(0xA28);	// @ (0x145 * 8 + 0)
#define                                 LATF0_bit           _BIT_ACCESS(LATF,0)
// LATF<LATF1>
extern volatile __bit                   LATF1               __at(0xA29);	// @ (0x145 * 8 + 1)
#define                                 LATF1_bit           _BIT_ACCESS(LATF,1)
// LATF<LATF2>
extern volatile __bit                   LATF2               __at(0xA2A);	// @ (0x145 * 8 + 2)
#define                                 LATF2_bit           _BIT_ACCESS(LATF,2)
// LATF<LATF3>
extern volatile __bit                   LATF3               __at(0xA2B);	// @ (0x145 * 8 + 3)
#define                                 LATF3_bit           _BIT_ACCESS(LATF,3)
// LATF<LATF4>
extern volatile __bit                   LATF4               __at(0xA2C);	// @ (0x145 * 8 + 4)
#define                                 LATF4_bit           _BIT_ACCESS(LATF,4)
// LATF<LATF5>
extern volatile __bit                   LATF5               __at(0xA2D);	// @ (0x145 * 8 + 5)
#define                                 LATF5_bit           _BIT_ACCESS(LATF,5)
// LATF<LATF6>
extern volatile __bit                   LATF6               __at(0xA2E);	// @ (0x145 * 8 + 6)
#define                                 LATF6_bit           _BIT_ACCESS(LATF,6)
// LATF<LATF7>
extern volatile __bit                   LATF7               __at(0xA2F);	// @ (0x145 * 8 + 7)
#define                                 LATF7_bit           _BIT_ACCESS(LATF,7)
// LATW<LATW0>
extern volatile __bit                   LATW0               __at(0x808);	// @ (0x101 * 8 + 0)
#define                                 LATW0_bit           _BIT_ACCESS(LATW,0)
// LATW<LATW1>
extern volatile __bit                   LATW1               __at(0x809);	// @ (0x101 * 8 + 1)
#define                                 LATW1_bit           _BIT_ACCESS(LATW,1)
// LATW<LATW2>
extern volatile __bit                   LATW2               __at(0x80A);	// @ (0x101 * 8 + 2)
#define                                 LATW2_bit           _BIT_ACCESS(LATW,2)
// LATW<LATW3>
extern volatile __bit                   LATW3               __at(0x80B);	// @ (0x101 * 8 + 3)
#define                                 LATW3_bit           _BIT_ACCESS(LATW,3)
// LATW<LATW4>
extern volatile __bit                   LATW4               __at(0x80C);	// @ (0x101 * 8 + 4)
