garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f55q71.h
#define                                 NOSC1_bit           _BIT_ACCESS(OSCCON1,5)
// OSCCON1<NOSC2>
extern volatile __bit                   NOSC2               __at(0x56E);	// @ (0xAD * 8 + 6)
#define                                 NOSC2_bit           _BIT_ACCESS(OSCCON1,6)
// OSCCON3<NOSCR>
extern volatile __bit                   NOSCR               __at(0x57B);	// @ (0xAF * 8 + 3)
#define                                 NOSCR_bit           _BIT_ACCESS(OSCCON3,3)
// I2C1STAT0<NOT_A>
extern volatile __bit                   NOT_A               __at(0x14C3);	// @ (0x298 * 8 + 3)
#define                                 NOT_A_bit           _BIT_ACCESS(I2C1STAT0,3)
// I2C1STAT0<NOT_ADDRESS>
extern volatile __bit                   NOT_ADDRESS         __at(0x14C3);	// @ (0x298 * 8 + 3)
#define                                 NOT_ADDRESS_bit     _BIT_ACCESS(I2C1STAT0,3)
// PCON0<NOT_BOR>
extern volatile __bit                   NOT_BOR             __at(0x2780);	// @ (0x4F0 * 8 + 0)
#define                                 NOT_BOR_bit         _BIT_ACCESS(PCON0,0)
// PCON1<NOT_MEMV>
extern volatile __bit                   NOT_MEMV            __at(0x2789);	// @ (0x4F1 * 8 + 1)
#define                                 NOT_MEMV_bit        _BIT_ACCESS(PCON1,1)
// PCON0<NOT_POR>
extern volatile __bit                   NOT_POR             __at(0x2781);	// @ (0x4F0 * 8 + 1)
#define                                 NOT_POR_bit         _BIT_ACCESS(PCON0,1)
// PCON1<NOT_RCM>
extern volatile __bit                   NOT_RCM             __at(0x2788);	// @ (0x4F1 * 8 + 0)
#define                                 NOT_RCM_bit         _BIT_ACCESS(PCON1,0)
// PCON0<NOT_RI>
extern volatile __bit                   NOT_RI              __at(0x2782);	// @ (0x4F0 * 8 + 2)
#define                                 NOT_RI_bit          _BIT_ACCESS(PCON0,2)
// PCON0<NOT_RMCLR>
extern volatile __bit                   NOT_RMCLR           __at(0x2783);	// @ (0x4F0 * 8 + 3)
#define                                 NOT_RMCLR_bit       _BIT_ACCESS(PCON0,3)
// PCON1<NOT_RVREG>
extern volatile __bit                   NOT_RVREG           __at(0x278A);	// @ (0x4F1 * 8 + 2)
#define                                 NOT_RVREG_bit       _BIT_ACCESS(PCON1,2)
// PCON0<NOT_RWDT>
extern volatile __bit                   NOT_RWDT            __at(0x2784);	// @ (0x4F0 * 8 + 4)
#define                                 NOT_RWDT_bit        _BIT_ACCESS(PCON0,4)
// T1GCON<NOT_T1DONE>
extern volatile __bit                   NOT_T1DONE          __at(0x18AB);	// @ (0x315 * 8 + 3)
#define                                 NOT_T1DONE_bit      _BIT_ACCESS(T1GCON,3)
// T1CON<NOT_T1SYNC>
extern volatile __bit                   NOT_T1SYNC          __at(0x18A2);	// @ (0x314 * 8 + 2)
#define                                 NOT_T1SYNC_bit      _BIT_ACCESS(T1CON,2)
// T3GCON<NOT_T3DONE>
extern volatile __bit                   NOT_T3DONE          __at(0x1933);	// @ (0x326 * 8 + 3)
#define                                 NOT_T3DONE_bit      _BIT_ACCESS(T3GCON,3)
// T3CON<NOT_T3SYNC>
extern volatile __bit                   NOT_T3SYNC          __at(0x192A);	// @ (0x325 * 8 + 2)
#define                                 NOT_T3SYNC_bit      _BIT_ACCESS(T3CON,2)
// I2C1STAT0<NOT_W>
extern volatile __bit                   NOT_W               __at(0x14C4);	// @ (0x298 * 8 + 4)
#define                                 NOT_W_bit           _BIT_ACCESS(I2C1STAT0,4)
// PCON0<NOT_WDTWV>
extern volatile __bit                   NOT_WDTWV           __at(0x2785);	// @ (0x4F0 * 8 + 5)
#define                                 NOT_WDTWV_bit       _BIT_ACCESS(PCON0,5)
// I2C1STAT0<NOT_WRITE>
extern volatile __bit                   NOT_WRITE           __at(0x14C4);	// @ (0x298 * 8 + 4)
#define                                 NOT_WRITE_bit       _BIT_ACCESS(I2C1STAT0,4)
// ADREF<NREF0>
extern volatile __bit                   NREF0               __at(0x1FC4);	// @ (0x3F8 * 8 + 4)
#define                                 NREF0_bit           _BIT_ACCESS(ADREF,4)
// NVMADRL<NVMADR0>
extern volatile __bit                   NVMADR0             __at(0x218);	// @ (0x43 * 8 + 0)
#define                                 NVMADR0_bit         _BIT_ACCESS(NVMADRL,0)
// NVMADRL<NVMADR1>
extern volatile __bit                   NVMADR1             __at(0x219);	// @ (0x43 * 8 + 1)
#define                                 NVMADR1_bit         _BIT_ACCESS(NVMADRL,1)
// NVMADRH<NVMADR10>
extern volatile __bit                   NVMADR10            __at(0x222);	// @ (0x44 * 8 + 2)
#define                                 NVMADR10_bit        _BIT_ACCESS(NVMADRH,2)
// NVMADRH<NVMADR11>
extern volatile __bit                   NVMADR11            __at(0x223);	// @ (0x44 * 8 + 3)
#define                                 NVMADR11_bit        _BIT_ACCESS(NVMADRH,3)
// NVMADRH<NVMADR12>
extern volatile __bit                   NVMADR12            __at(0x224);	// @ (0x44 * 8 + 4)
#define                                 NVMADR12_bit        _BIT_ACCESS(NVMADRH,4)
// NVMADRH<NVMADR13>
extern volatile __bit                   NVMADR13            __at(0x225);	// @ (0x44 * 8 + 5)
#define                                 NVMADR13_bit        _BIT_ACCESS(NVMADRH,5)
// NVMADRH<NVMADR14>
extern volatile __bit                   NVMADR14            __at(0x226);	// @ (0x44 * 8 + 6)
#define                                 NVMADR14_bit        _BIT_ACCESS(NVMADRH,6)
// NVMADRH<NVMADR15>
extern volatile __bit                   NVMADR15            __at(0x227);	// @ (0x44 * 8 + 7)
#define                                 NVMADR15_bit        _BIT_ACCESS(NVMADRH,7)
// NVMADRU<NVMADR16>
extern volatile __bit                   NVMADR16            __at(0x228);	// @ (0x45 * 8 + 0)
#define                                 NVMADR16_bit        _BIT_ACCESS(NVMADRU,0)
// NVMADRU<NVMADR17>
extern volatile __bit                   NVMADR17            __at(0x229);	// @ (0x45 * 8 + 1)
#define                                 NVMADR17_bit        _BIT_ACCESS(NVMADRU,1)
// NVMADRU<NVMADR18>
extern volatile __bit                   NVMADR18            __at(0x22A);	// @ (0x45 * 8 + 2)
#define                                 NVMADR18_bit        _BIT_ACCESS(NVMADRU,2)
// NVMADRU<NVMADR19>
extern volatile __bit                   NVMADR19            __at(0x22B);	// @ (0x45 * 8 + 3)
#define                                 NVMADR19_bit        _BIT_ACCESS(NVMADRU,3)
// NVMADRL<NVMADR2>
extern volatile __bit                   NVMADR2             __at(0x21A);	// @ (0x43 * 8 + 2)
#define                                 NVMADR2_bit         _BIT_ACCESS(NVMADRL,2)
// NVMADRU<NVMADR20>
extern volatile __bit                   NVMADR20            __at(0x22C);	// @ (0x45 * 8 + 4)
#define                                 NVMADR20_bit        _BIT_ACCESS(NVMADRU,4)
// NVMADRU<NVMADR21>
extern volatile __bit                   NVMADR21            __at(0x22D);	// @ (0x45 * 8 + 5)
#define                                 NVMADR21_bit        _BIT_ACCESS(NVMADRU,5)
// NVMADRL<NVMADR3>
extern volatile __bit                   NVMADR3             __at(0x21B);	// @ (0x43 * 8 + 3)
#define                                 NVMADR3_bit         _BIT_ACCESS(NVMADRL,3)
// NVMADRL<NVMADR4>
extern volatile __bit                   NVMADR4             __at(0x21C);	// @ (0x43 * 8 + 4)
#define                                 NVMADR4_bit         _BIT_ACCESS(NVMADRL,4)
// NVMADRL<NVMADR5>
extern volatile __bit                   NVMADR5             __at(0x21D);	// @ (0x43 * 8 + 5)
#define                                 NVMADR5_bit         _BIT_ACCESS(NVMADRL,5)
// NVMADRL<NVMADR6>
extern volatile __bit                   NVMADR6             __at(0x21E);	// @ (0x43 * 8 + 6)
#define                                 NVMADR6_bit         _BIT_ACCESS(NVMADRL,6)
// NVMADRL<NVMADR7>
extern volatile __bit                   NVMADR7             __at(0x21F);	// @ (0x43 * 8 + 7)
#define                                 NVMADR7_bit         _BIT_ACCESS(NVMADRL,7)
// NVMADRH<NVMADR8>
extern volatile __bit                   NVMADR8             __at(0x220);	// @ (0x44 * 8 + 0)
#define                                 NVMADR8_bit         _BIT_ACCESS(NVMADRH,0)
// NVMADRH<NVMADR9>
extern volatile __bit                   NVMADR9             __at(0x221);	// @ (0x44 * 8 + 1)
#define                                 NVMADR9_bit         _BIT_ACCESS(NVMADRH,1)
// NVMDATL<NVMDAT0>
extern volatile __bit                   NVMDAT0             __at(0x230);	// @ (0x46 * 8 + 0)
#define                                 NVMDAT0_bit         _BIT_ACCESS(NVMDATL,0)
// NVMDATL<NVMDAT1>
extern volatile __bit                   NVMDAT1             __at(0x231);	// @ (0x46 * 8 + 1)
#define                                 NVMDAT1_bit         _BIT_ACCESS(NVMDATL,1)
// NVMDATH<NVMDAT10>
extern volatile __bit                   NVMDAT10            __at(0x23A);	// @ (0x47 * 8 + 2)
#define                                 NVMDAT10_bit        _BIT_ACCESS(NVMDATH,2)
// NVMDATH<NVMDAT11>
extern volatile __bit                   NVMDAT11            __at(0x23B);	// @ (0x47 * 8 + 3)
#define                                 NVMDAT11_bit        _BIT_ACCESS(NVMDATH,3)
// NVMDATH<NVMDAT12>
extern volatile __bit                   NVMDAT12            __at(0x23C);	// @ (0x47 * 8 + 4)
#define                                 NVMDAT12_bit        _BIT_ACCESS(NVMDATH,4)
// NVMDATH<NVMDAT13>
extern volatile __bit                   NVMDAT13            __at(0x23D);	// @ (0x47 * 8 + 5)
#define                                 NVMDAT13_bit        _BIT_ACCESS(NVMDATH,5)
// NVMDATH<NVMDAT14>
extern volatile __bit                   NVMDAT14            __at(0x23E);	// @ (0x47 * 8 + 6)
#define                                 NVMDAT14_bit        _BIT_ACCESS(NVMDATH,6)
// NVMDATH<NVMDAT15>
extern volatile __bit                   NVMDAT15            __at(0x23F);	// @ (0x47 * 8 + 7)
#define                                 NVMDAT15_bit        _BIT_ACCESS(NVMDATH,7)
// NVMDATL<NVMDAT2>
extern volatile __bit                   NVMDAT2             __at(0x232);	// @ (0x46 * 8 + 2)
#define                                 NVMDAT2_bit         _BIT_ACCESS(NVMDATL,2)
// NVMDATL<NVMDAT3>
extern volatile __bit                   NVMDAT3             __at(0x233);	// @ (0x46 * 8 + 3)
#define                                 NVMDAT3_bit         _BIT_ACCESS(NVMDATL,3)
// NVMDATL<NVMDAT4>
extern volatile __bit                   NVMDAT4             __at(0x234);	// @ (0x46 * 8 + 4)
#define                                 NVMDAT4_bit         _BIT_ACCESS(NVMDATL,4)
// NVMDATL<NVMDAT5>
extern volatile __bit                   NVMDAT5             __at(0x235);	// @ (0x46 * 8 + 5)
#define                                 NVMDAT5_bit         _BIT_ACCESS(NVMDATL,5)
// NVMDATL<NVMDAT6>
extern volatile __bit                   NVMDAT6             __at(0x236);	// @ (0x46 * 8 + 6)
#define                                 NVMDAT6_bit         _BIT_ACCESS(NVMDATL,6)
// NVMDATL<NVMDAT7>
extern volatile __bit                   NVMDAT7             __at(0x237);	// @ (0x46 * 8 + 7)
#define                                 NVMDAT7_bit         _BIT_ACCESS(NVMDATL,7)
// NVMDATH<NVMDAT8>
extern volatile __bit                   NVMDAT8             __at(0x238);	// @ (0x47 * 8 + 0)
#define                                 NVMDAT8_bit         _BIT_ACCESS(NVMDATH,0)
// NVMDATH<NVMDAT9>
extern volatile __bit                   NVMDAT9             __at(0x239);	// @ (0x47 * 8 + 1)
#define                                 NVMDAT9_bit         _BIT_ACCESS(NVMDATH,1)
// NVMCON0<NVMGO>
extern volatile __bit                   NVMGO               __at(0x200);	// @ (0x40 * 8 + 0)
#define                                 NVMGO_bit           _BIT_ACCESS(NVMCON0,0)
// PIE0<NVMIE>
extern volatile __bit                   NVMIE               __at(0x253C);	// @ (0x4A7 * 8 + 4)
#define                                 NVMIE_bit           _BIT_ACCESS(PIE0,4)
// PIR0<NVMIF>
extern volatile __bit                   NVMIF               __at(0x2594);	// @ (0x4B2 * 8 + 4)
#define                                 NVMIF_bit           _BIT_ACCESS(PIR0,4)
// IPR0<NVMIP>
extern volatile __bit                   NVMIP               __at(0x24E4);	// @ (0x49C * 8 + 4)
#define                                 NVMIP_bit           _BIT_ACCESS(IPR0,4)
// ODCONA<ODCA0>
extern volatile __bit                   ODCA0               __at(0x2010);	// @ (0x402 * 8 + 0)
#define                                 ODCA0_bit           _BIT_ACCESS(ODCONA,0)
// ODCONA<ODCA1>
extern volatile __bit                   ODCA1               __at(0x2011);	// @ (0x402 * 8 + 1)
#define                                 ODCA1_bit           _BIT_ACCESS(ODCONA,1)
// ODCONA<ODCA2>
extern volatile __bit                   ODCA2               __at(0x2012);	// @ (0x402 * 8 + 2)
#define                                 ODCA2_bit           _BIT_ACCESS(ODCONA,2)
// ODCONA<ODCA3>
extern volatile __bit                   ODCA3               __at(0x2013);	// @ (0x402 * 8 + 3)
#define                                 ODCA3_bit           _BIT_ACCESS(ODCONA,3)
// ODCONA<ODCA4>
extern volatile __bit                   ODCA4               __at(0x2014);	// @ (0x402 * 8 + 4)
#define                                 ODCA4_bit           _BIT_ACCESS(ODCONA,4)
// ODCONA<ODCA5>
extern volatile __bit                   ODCA5               __at(0x2015);	// @ (0x402 * 8 + 5)
#define                                 ODCA5_bit           _BIT_ACCESS(ODCONA,5)
// ODCONA<ODCA6>
extern volatile __bit                   ODCA6               __at(0x2016);	// @ (0x402 * 8 + 6)
#define                                 ODCA6_bit           _BIT_ACCESS(ODCONA,6)
// ODCONA<ODCA7>
extern volatile __bit                   ODCA7               __at(0x2017);	// @ (0x402 * 8 + 7)
#define                                 ODCA7_bit           _BIT_ACCESS(ODCONA,7)
// ODCONB<ODCB0>
extern volatile __bit                   ODCB0               __at(0x2050);	// @ (0x40A * 8 + 0)
#define                                 ODCB0_bit           _BIT_ACCESS(ODCONB,0)
// ODCONB<ODCB1>
extern volatile __bit                   ODCB1               __at(0x2051);	// @ (0x40A * 8 + 1)
#define                                 ODCB1_bit           _BIT_ACCESS(ODCONB,1)
// ODCONB<ODCB2>
extern volatile __bit                   ODCB2               __at(0x2052);	// @ (0x40A * 8 + 2)
#define                                 ODCB2_bit           _BIT_ACCESS(ODCONB,2)
// ODCONB<ODCB3>
extern volatile __bit                   ODCB3               __at(0x2053);	// @ (0x40A * 8 + 3)
#define                                 ODCB3_bit           _BIT_ACCESS(ODCONB,3)
// ODCONB<ODCB4>
extern volatile __bit                   ODCB4               __at(0x2054);	// @ (0x40A * 8 + 4)
#define                                 ODCB4_bit           _BIT_ACCESS(ODCONB,4)
// ODCONB<ODCB5>
extern volatile __bit                   ODCB5               __at(0x2055);	// @ (0x40A * 8 + 5)
#define                                 ODCB5_bit           _BIT_ACCESS(ODCONB,5)
// ODCONB<ODCB6>
extern volatile __bit                   ODCB6               __at(0x2056);	// @ (0x40A * 8 + 6)
#define                                 ODCB6_bit           _BIT_ACCESS(ODCONB,6)
// ODCONB<ODCB7>
extern volatile __bit                   ODCB7               __at(0x2057);	// @ (0x40A * 8 + 7)
#define                                 ODCB7_bit           _BIT_ACCESS(ODCONB,7)
// ODCONC<ODCC0>
extern volatile __bit                   ODCC0               __at(0x2090);	// @ (0x412 * 8 + 0)
#define                                 ODCC0_bit           _BIT_ACCESS(ODCONC,0)
// ODCONC<ODCC1>
extern volatile __bit                   ODCC1               __at(0x2091);	// @ (0x412 * 8 + 1)
#define                                 ODCC1_bit           _BIT_ACCESS(ODCONC,1)
// ODCONC<ODCC2>
extern volatile __bit                   ODCC2               __at(0x2092);	// @ (0x412 * 8 + 2)
#define                                 ODCC2_bit           _BIT_ACCESS(ODCONC,2)
// ODCONC<ODCC3>
extern volatile __bit                   ODCC3               __at(0x2093);	// @ (0x412 * 8 + 3)
#define                                 ODCC3_bit           _BIT_ACCESS(ODCONC,3)
// ODCONC<ODCC4>
extern volatile __bit                   ODCC4               __at(0x2094);	// @ (0x412 * 8 + 4)
#define                                 ODCC4_bit           _BIT_ACCESS(ODCONC,4)
// ODCONC<ODCC5>
extern volatile __bit                   ODCC5               __at(0x2095);	// @ (0x412 * 8 + 5)
#define                                 ODCC5_bit           _BIT_ACCESS(ODCONC,5)
// ODCONC<ODCC6>
extern volatile __bit                   ODCC6               __at(0x2096);	// @ (0x412 * 8 + 6)
#define                                 ODCC6_bit           _BIT_ACCESS(ODCONC,6)
// ODCONC<ODCC7>
extern volatile __bit                   ODCC7               __at(0x2097);	// @ (0x412 * 8 + 7)
#define                                 ODCC7_bit           _BIT_ACCESS(ODCONC,7)
// ODCOND<ODCD0>
extern volatile __bit                   ODCD0               __at(0x20D0);	// @ (0x41A * 8 + 0)
#define                                 ODCD0_bit           _BIT_ACCESS(ODCOND,0)
// ODCOND<ODCD1>
extern volatile __bit                   ODCD1               __at(0x20D1);	// @ (0x41A * 8 + 1)
#define                                 ODCD1_bit           _BIT_ACCESS(ODCOND,1)
// ODCOND<ODCD2>
extern volatile __bit                   ODCD2               __at(0x20D2);	// @ (0x41A * 8 + 2)
#define                                 ODCD2_bit           _BIT_ACCESS(ODCOND,2)
// ODCOND<ODCD3>
extern volatile __bit                   ODCD3               __at(0x20D3);	// @ (0x41A * 8 + 3)
#define                                 ODCD3_bit           _BIT_ACCESS(ODCOND,3)
// ODCOND<ODCD4>
extern volatile __bit                   ODCD4               __at(0x20D4);	// @ (0x41A * 8 + 4)
#define                                 ODCD4_bit           _BIT_ACCESS(ODCOND,4)
// ODCOND<ODCD5>
extern volatile __bit                   ODCD5               __at(0x20D5);	// @ (0x41A * 8 + 5)
#define                                 ODCD5_bit           _BIT_ACCESS(ODCOND,5)
// ODCOND<ODCD6>
extern volatile __bit                   ODCD6               __at(0x20D6);	// @ (0x41A * 8 + 6)
#define                                 ODCD6_bit           _BIT_ACCESS(ODCOND,6)
// ODCOND<ODCD7>
extern volatile __bit                   ODCD7               __at(0x20D7);	// @ (0x41A * 8 + 7)
#define                                 ODCD7_bit           _BIT_ACCESS(ODCOND,7)
// ODCONE<ODCE0>
extern volatile __bit                   ODCE0               __at(0x2110);	// @ (0x422 * 8 + 0)
#define                                 ODCE0_bit           _BIT_ACCESS(ODCONE,0)
// ODCONE<ODCE1>
extern volatile __bit                   ODCE1               __at(0x2111);	// @ (0x422 * 8 + 1)
#define                                 ODCE1_bit           _BIT_ACCESS(ODCONE,1)
// ODCONE<ODCE2>
extern volatile __bit                   ODCE2               __at(0x2112);	// @ (0x422 * 8 + 2)
#define                                 ODCE2_bit           _BIT_ACCESS(ODCONE,2)
// ODCONF<ODCF0>
extern volatile __bit                   ODCF0               __at(0x2150);	// @ (0x42A * 8 + 0)
#define                                 ODCF0_bit           _BIT_ACCESS(ODCONF,0)
// ODCONF<ODCF1>
extern volatile __bit                   ODCF1               __at(0x2151);	// @ (0x42A * 8 + 1)
#define                                 ODCF1_bit           _BIT_ACCESS(ODCONF,1)
// ODCONF<ODCF2>
extern volatile __bit                   ODCF2               __at(0x2152);	// @ (0x42A * 8 + 2)
#define                                 ODCF2_bit           _BIT_ACCESS(ODCONF,2)
// ODCONF<ODCF3>
extern volatile __bit                   ODCF3               __at(0x2153);	// @ (0x42A * 8 + 3)
#define                                 ODCF3_bit           _BIT_ACCESS(ODCONF,3)
// ODCONF<ODCF4>
extern volatile __bit                   ODCF4               __at(0x2154);	// @ (0x42A * 8 + 4)
#define                                 ODCF4_bit           _BIT_ACCESS(ODCONF,4)
// ODCONF<ODCF5>
extern volatile __bit                   ODCF5               __at(0x2155);	// @ (0x42A * 8 + 5)
#define                                 ODCF5_bit           _BIT_ACCESS(ODCONF,5)
// ODCONF<ODCF6>
extern volatile __bit                   ODCF6               __at(0x2156);	// @ (0x42A * 8 + 6)
#define                                 ODCF6_bit           _BIT_ACCESS(ODCONF,6)
// ODCONF<ODCF7>
extern volatile __bit                   ODCF7               __at(0x2157);	// @ (0x42A * 8 + 7)
#define                                 ODCF7_bit           _BIT_ACCESS(ODCONF,7)
// OPA1CON0<OPA1CPON>
extern volatile __bit                   OPA1CPON            __at(0x8FD);	// @ (0x11F * 8 + 5)
#define                                 OPA1CPON_bit        _BIT_ACCESS(OPA1CON0,5)
// OPA1CON0<OPA1EN>
extern volatile __bit                   OPA1EN              __at(0x8FF);	// @ (0x11F * 8 + 7)
#define                                 OPA1EN_bit          _BIT_ACCESS(OPA1CON0,7)
// OPA1CON3<OPA1FMS0>
extern volatile __bit                   OPA1FMS0            __at(0x916);	// @ (0x122 * 8 + 6)
#define                                 OPA1FMS0_bit        _BIT_ACCESS(OPA1CON3,6)
// OPA1CON3<OPA1FMS1>
extern volatile __bit                   OPA1FMS1            __at(0x917);	// @ (0x122 * 8 + 7)
#define                                 OPA1FMS1_bit        _BIT_ACCESS(OPA1CON3,7)
// OPA1CON1<OPA1GSEL0>
extern volatile __bit                   OPA1GSEL0           __at(0x904);	// @ (0x120 * 8 + 4)
#define                                 OPA1GSEL0_bit       _BIT_ACCESS(OPA1CON1,4)
// OPA1CON1<OPA1GSEL1>
extern volatile __bit                   OPA1GSEL1           __at(0x905);	// @ (0x120 * 8 + 5)
#define                                 OPA1GSEL1_bit       _BIT_ACCESS(OPA1CON1,5)
// OPA1CON1<OPA1GSEL2>
extern volatile __bit                   OPA1GSEL2           __at(0x906);	// @ (0x120 * 8 + 6)
#define                                 OPA1GSEL2_bit       _BIT_ACCESS(OPA1CON1,6)
// OPA1HWC<OPA1HWCH0>
extern volatile __bit                   OPA1HWCH0           __at(0x924);	// @ (0x124 * 8 + 4)
#define                                 OPA1HWCH0_bit       _BIT_ACCESS(OPA1HWC,4)
// OPA1HWC<OPA1HWCH1>
extern volatile __bit                   OPA1HWCH1           __at(0x925);	// @ (0x124 * 8 + 5)
#define                                 OPA1HWCH1_bit       _BIT_ACCESS(OPA1HWC,5)
// OPA1HWC<OPA1HWCH2>
extern volatile __bit                   OPA1HWCH2           __at(0x926);	// @ (0x124 * 8 + 6)
#define                                 OPA1HWCH2_bit       _BIT_ACCESS(OPA1HWC,6)
// OPA1HWC<OPA1HWCL0>
extern volatile __bit                   OPA1HWCL0           __at(0x920);	// @ (0x124 * 8 + 0)
#define                                 OPA1HWCL0_bit       _BIT_ACCESS(OPA1HWC,0)
// OPA1HWC<OPA1HWCL1>
extern volatile __bit                   OPA1HWCL1           __at(0x921);	// @ (0x124 * 8 + 1)
#define                                 OPA1HWCL1_bit       _BIT_ACCESS(OPA1HWC,1)
// OPA1HWC<OPA1HWCL2>
extern volatile __bit                   OPA1HWCL2           __at(0x922);	// @ (0x124 * 8 + 2)
#define                                 OPA1HWCL2_bit       _BIT_ACCESS(OPA1HWC,2)
// OPA1CON3<OPA1INTOE>
extern volatile __bit                   OPA1INTOE           __at(0x915);	// @ (0x122 * 8 + 5)
#define                                 OPA1INTOE_bit       _BIT_ACCESS(OPA1CON3,5)
// PMD5<OPA1MD>
extern volatile __bit                   OPA1MD              __at(0x33A);	// @ (0x67 * 8 + 2)
#define                                 OPA1MD_bit          _BIT_ACCESS(PMD5,2)
// OPA1CON2<OPA1NCH0>
extern volatile __bit                   OPA1NCH0            __at(0x90C);	// @ (0x121 * 8 + 4)
#define                                 OPA1NCH0_bit        _BIT_ACCESS(OPA1CON2,4)
// OPA1CON2<OPA1NCH1>
extern volatile __bit                   OPA1NCH1            __at(0x90D);	// @ (0x121 * 8 + 5)
#define                                 OPA1NCH1_bit        _BIT_ACCESS(OPA1CON2,5)
// OPA1CON2<OPA1NCH2>
