garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f55q71.h
extern volatile __bit                   U1TXBF              __at(0x157C);	// @ (0x2AF * 8 + 4)
#define                                 U1TXBF_bit          _BIT_ACCESS(U1FIFO,4)
// U1ERRIE<U1TXCIE>
extern volatile __bit                   U1TXCIE             __at(0x1590);	// @ (0x2B2 * 8 + 0)
#define                                 U1TXCIE_bit         _BIT_ACCESS(U1ERRIE,0)
// U1ERRIR<U1TXCIF>
extern volatile __bit                   U1TXCIF             __at(0x1588);	// @ (0x2B1 * 8 + 0)
#define                                 U1TXCIF_bit         _BIT_ACCESS(U1ERRIR,0)
// U1CON0<U1TXEN>
extern volatile __bit                   U1TXEN              __at(0x1555);	// @ (0x2AA * 8 + 5)
#define                                 U1TXEN_bit          _BIT_ACCESS(U1CON0,5)
// PIE4<U1TXIE>
extern volatile __bit                   U1TXIE              __at(0x2559);	// @ (0x4AB * 8 + 1)
#define                                 U1TXIE_bit          _BIT_ACCESS(PIE4,1)
// PIR4<U1TXIF>
extern volatile __bit                   U1TXIF              __at(0x25B1);	// @ (0x4B6 * 8 + 1)
#define                                 U1TXIF_bit          _BIT_ACCESS(PIR4,1)
// IPR4<U1TXIP>
extern volatile __bit                   U1TXIP              __at(0x2501);	// @ (0x4A0 * 8 + 1)
#define                                 U1TXIP_bit          _BIT_ACCESS(IPR4,1)
// U1ERRIE<U1TXMTIE>
extern volatile __bit                   U1TXMTIE            __at(0x1597);	// @ (0x2B2 * 8 + 7)
#define                                 U1TXMTIE_bit        _BIT_ACCESS(U1ERRIE,7)
// U1ERRIR<U1TXMTIF>
extern volatile __bit                   U1TXMTIF            __at(0x158F);	// @ (0x2B1 * 8 + 7)
#define                                 U1TXMTIF_bit        _BIT_ACCESS(U1ERRIR,7)
// U1CON2<U1TXPOL>
extern volatile __bit                   U1TXPOL             __at(0x1562);	// @ (0x2AC * 8 + 2)
#define                                 U1TXPOL_bit         _BIT_ACCESS(U1CON2,2)
// U1FIFO<U1TXWRE>
extern volatile __bit                   U1TXWRE             __at(0x157F);	// @ (0x2AF * 8 + 7)
#define                                 U1TXWRE_bit         _BIT_ACCESS(U1FIFO,7)
// U1CON1<U1WUE>
extern volatile __bit                   U1WUE               __at(0x155C);	// @ (0x2AB * 8 + 4)
#define                                 U1WUE_bit           _BIT_ACCESS(U1CON1,4)
// U1UIR<U1WUIF>
extern volatile __bit                   U1WUIF              __at(0x1587);	// @ (0x2B0 * 8 + 7)
#define                                 U1WUIF_bit          _BIT_ACCESS(U1UIR,7)
// U1FIFO<U1XON>
extern volatile __bit                   U1XON               __at(0x157A);	// @ (0x2AF * 8 + 2)
#define                                 U1XON_bit           _BIT_ACCESS(U1FIFO,2)
// U2CON0<U2ABDEN>
extern volatile __bit                   U2ABDEN             __at(0x15F6);	// @ (0x2BE * 8 + 6)
#define                                 U2ABDEN_bit         _BIT_ACCESS(U2CON0,6)
// U2UIR<U2ABDIE>
extern volatile __bit                   U2ABDIE             __at(0x1622);	// @ (0x2C4 * 8 + 2)
#define                                 U2ABDIE_bit         _BIT_ACCESS(U2UIR,2)
// U2UIR<U2ABDIF>
extern volatile __bit                   U2ABDIF             __at(0x1626);	// @ (0x2C4 * 8 + 6)
#define                                 U2ABDIF_bit         _BIT_ACCESS(U2UIR,6)
// U2ERRIE<U2ABDOVE>
extern volatile __bit                   U2ABDOVE            __at(0x1635);	// @ (0x2C6 * 8 + 5)
#define                                 U2ABDOVE_bit        _BIT_ACCESS(U2ERRIE,5)
// U2ERRIR<U2ABDOVF>
extern volatile __bit                   U2ABDOVF            __at(0x162D);	// @ (0x2C5 * 8 + 5)
#define                                 U2ABDOVF_bit        _BIT_ACCESS(U2ERRIR,5)
// U2CON0<U2BRGS>
extern volatile __bit                   U2BRGS              __at(0x15F7);	// @ (0x2BE * 8 + 7)
#define                                 U2BRGS_bit          _BIT_ACCESS(U2CON0,7)
// U2CON1<U2BRKOVR>
extern volatile __bit                   U2BRKOVR            __at(0x15F9);	// @ (0x2BF * 8 + 1)
#define                                 U2BRKOVR_bit        _BIT_ACCESS(U2CON1,1)
// U2ERRIE<U2CERIE>
extern volatile __bit                   U2CERIE             __at(0x1634);	// @ (0x2C6 * 8 + 4)
#define                                 U2CERIE_bit         _BIT_ACCESS(U2ERRIE,4)
// U2ERRIR<U2CERIF>
extern volatile __bit                   U2CERIF             __at(0x162C);	// @ (0x2C5 * 8 + 4)
#define                                 U2CERIF_bit         _BIT_ACCESS(U2ERRIR,4)
// U2CTSPPS<U2CTSPPS0>
extern volatile __bit                   U2CTSPPS0           __at(0x13A8);	// @ (0x275 * 8 + 0)
#define                                 U2CTSPPS0_bit       _BIT_ACCESS(U2CTSPPS,0)
// U2CTSPPS<U2CTSPPS1>
extern volatile __bit                   U2CTSPPS1           __at(0x13A9);	// @ (0x275 * 8 + 1)
#define                                 U2CTSPPS1_bit       _BIT_ACCESS(U2CTSPPS,1)
// U2CTSPPS<U2CTSPPS2>
extern volatile __bit                   U2CTSPPS2           __at(0x13AA);	// @ (0x275 * 8 + 2)
#define                                 U2CTSPPS2_bit       _BIT_ACCESS(U2CTSPPS,2)
// U2CTSPPS<U2CTSPPS3>
extern volatile __bit                   U2CTSPPS3           __at(0x13AB);	// @ (0x275 * 8 + 3)
#define                                 U2CTSPPS3_bit       _BIT_ACCESS(U2CTSPPS,3)
// U2CTSPPS<U2CTSPPS4>
extern volatile __bit                   U2CTSPPS4           __at(0x13AC);	// @ (0x275 * 8 + 4)
#define                                 U2CTSPPS4_bit       _BIT_ACCESS(U2CTSPPS,4)
// U2CTSPPS<U2CTSPPS5>
extern volatile __bit                   U2CTSPPS5           __at(0x13AD);	// @ (0x275 * 8 + 5)
#define                                 U2CTSPPS5_bit       _BIT_ACCESS(U2CTSPPS,5)
// PIE8<U2EIE>
extern volatile __bit                   U2EIE               __at(0x257A);	// @ (0x4AF * 8 + 2)
#define                                 U2EIE_bit           _BIT_ACCESS(PIE8,2)
// PIR8<U2EIF>
extern volatile __bit                   U2EIF               __at(0x25D2);	// @ (0x4BA * 8 + 2)
#define                                 U2EIF_bit           _BIT_ACCESS(PIR8,2)
// IPR8<U2EIP>
extern volatile __bit                   U2EIP               __at(0x2522);	// @ (0x4A4 * 8 + 2)
#define                                 U2EIP_bit           _BIT_ACCESS(IPR8,2)
// U2ERRIE<U2FERIE>
extern volatile __bit                   U2FERIE             __at(0x1633);	// @ (0x2C6 * 8 + 3)
#define                                 U2FERIE_bit         _BIT_ACCESS(U2ERRIE,3)
// U2ERRIR<U2FERIF>
extern volatile __bit                   U2FERIF             __at(0x162B);	// @ (0x2C5 * 8 + 3)
#define                                 U2FERIF_bit         _BIT_ACCESS(U2ERRIR,3)
// U2CON2<U2FLO0>
extern volatile __bit                   U2FLO0              __at(0x1600);	// @ (0x2C0 * 8 + 0)
#define                                 U2FLO0_bit          _BIT_ACCESS(U2CON2,0)
// U2CON2<U2FLO1>
extern volatile __bit                   U2FLO1              __at(0x1601);	// @ (0x2C0 * 8 + 1)
#define                                 U2FLO1_bit          _BIT_ACCESS(U2CON2,1)
// PIE8<U2IE>
extern volatile __bit                   U2IE                __at(0x257B);	// @ (0x4AF * 8 + 3)
#define                                 U2IE_bit            _BIT_ACCESS(PIE8,3)
// PIR8<U2IF>
extern volatile __bit                   U2IF                __at(0x25D3);	// @ (0x4BA * 8 + 3)
#define                                 U2IF_bit            _BIT_ACCESS(PIR8,3)
// IPR8<U2IP>
extern volatile __bit                   U2IP                __at(0x2523);	// @ (0x4A4 * 8 + 3)
#define                                 U2IP_bit            _BIT_ACCESS(IPR8,3)
// PMD3<U2MD>
extern volatile __bit                   U2MD                __at(0x32F);	// @ (0x65 * 8 + 7)
#define                                 U2MD_bit            _BIT_ACCESS(PMD3,7)
// U2CON0<U2MODE0>
extern volatile __bit                   U2MODE0             __at(0x15F0);	// @ (0x2BE * 8 + 0)
#define                                 U2MODE0_bit         _BIT_ACCESS(U2CON0,0)
// U2CON0<U2MODE1>
extern volatile __bit                   U2MODE1             __at(0x15F1);	// @ (0x2BE * 8 + 1)
#define                                 U2MODE1_bit         _BIT_ACCESS(U2CON0,1)
// U2CON0<U2MODE2>
extern volatile __bit                   U2MODE2             __at(0x15F2);	// @ (0x2BE * 8 + 2)
#define                                 U2MODE2_bit         _BIT_ACCESS(U2CON0,2)
// U2CON0<U2MODE3>
extern volatile __bit                   U2MODE3             __at(0x15F3);	// @ (0x2BE * 8 + 3)
#define                                 U2MODE3_bit         _BIT_ACCESS(U2CON0,3)
// U2CON1<U2ON>
extern volatile __bit                   U2ON                __at(0x15FF);	// @ (0x2BF * 8 + 7)
#define                                 U2ON_bit            _BIT_ACCESS(U2CON1,7)
// U2ERRIE<U2PERIE>
extern volatile __bit                   U2PERIE             __at(0x1636);	// @ (0x2C6 * 8 + 6)
#define                                 U2PERIE_bit         _BIT_ACCESS(U2ERRIE,6)
// U2ERRIR<U2PERIF>
extern volatile __bit                   U2PERIF             __at(0x162E);	// @ (0x2C5 * 8 + 6)
#define                                 U2PERIF_bit         _BIT_ACCESS(U2ERRIR,6)
// U2FIFO<U2RCIDL>
extern volatile __bit                   U2RCIDL             __at(0x161B);	// @ (0x2C3 * 8 + 3)
#define                                 U2RCIDL_bit         _BIT_ACCESS(U2FIFO,3)
// U2CON2<U2RUNOVF>
extern volatile __bit                   U2RUNOVF            __at(0x1607);	// @ (0x2C0 * 8 + 7)
#define                                 U2RUNOVF_bit        _BIT_ACCESS(U2CON2,7)
// U2FIFO<U2RXBE>
extern volatile __bit                   U2RXBE              __at(0x1619);	// @ (0x2C3 * 8 + 1)
#define                                 U2RXBE_bit          _BIT_ACCESS(U2FIFO,1)
// U2FIFO<U2RXBF>
extern volatile __bit                   U2RXBF              __at(0x1618);	// @ (0x2C3 * 8 + 0)
#define                                 U2RXBF_bit          _BIT_ACCESS(U2FIFO,0)
// U2CON1<U2RXBIMD>
extern volatile __bit                   U2RXBIMD            __at(0x15FB);	// @ (0x2BF * 8 + 3)
#define                                 U2RXBIMD_bit        _BIT_ACCESS(U2CON1,3)
// U2ERRIE<U2RXBKIE>
extern volatile __bit                   U2RXBKIE            __at(0x1632);	// @ (0x2C6 * 8 + 2)
#define                                 U2RXBKIE_bit        _BIT_ACCESS(U2ERRIE,2)
// U2ERRIR<U2RXBKIF>
extern volatile __bit                   U2RXBKIF            __at(0x162A);	// @ (0x2C5 * 8 + 2)
#define                                 U2RXBKIF_bit        _BIT_ACCESS(U2ERRIR,2)
// U2CON0<U2RXEN>
extern volatile __bit                   U2RXEN              __at(0x15F4);	// @ (0x2BE * 8 + 4)
#define                                 U2RXEN_bit          _BIT_ACCESS(U2CON0,4)
// U2ERRIE<U2RXFOIE>
extern volatile __bit                   U2RXFOIE            __at(0x1631);	// @ (0x2C6 * 8 + 1)
#define                                 U2RXFOIE_bit        _BIT_ACCESS(U2ERRIE,1)
// U2ERRIR<U2RXFOIF>
extern volatile __bit                   U2RXFOIF            __at(0x1629);	// @ (0x2C5 * 8 + 1)
#define                                 U2RXFOIF_bit        _BIT_ACCESS(U2ERRIR,1)
// U2FIFO<U2RXIDL>
extern volatile __bit                   U2RXIDL             __at(0x161B);	// @ (0x2C3 * 8 + 3)
#define                                 U2RXIDL_bit         _BIT_ACCESS(U2FIFO,3)
// PIE8<U2RXIE>
extern volatile __bit                   U2RXIE              __at(0x2578);	// @ (0x4AF * 8 + 0)
#define                                 U2RXIE_bit          _BIT_ACCESS(PIE8,0)
// PIR8<U2RXIF>
extern volatile __bit                   U2RXIF              __at(0x25D0);	// @ (0x4BA * 8 + 0)
#define                                 U2RXIF_bit          _BIT_ACCESS(PIR8,0)
// IPR8<U2RXIP>
extern volatile __bit                   U2RXIP              __at(0x2520);	// @ (0x4A4 * 8 + 0)
#define                                 U2RXIP_bit          _BIT_ACCESS(IPR8,0)
// U2CON2<U2RXPOL>
extern volatile __bit                   U2RXPOL             __at(0x1606);	// @ (0x2C0 * 8 + 6)
#define                                 U2RXPOL_bit         _BIT_ACCESS(U2CON2,6)
// U2RXPPS<U2RXPPS0>
extern volatile __bit                   U2RXPPS0            __at(0x13A0);	// @ (0x274 * 8 + 0)
#define                                 U2RXPPS0_bit        _BIT_ACCESS(U2RXPPS,0)
// U2RXPPS<U2RXPPS1>
extern volatile __bit                   U2RXPPS1            __at(0x13A1);	// @ (0x274 * 8 + 1)
#define                                 U2RXPPS1_bit        _BIT_ACCESS(U2RXPPS,1)
// U2RXPPS<U2RXPPS2>
extern volatile __bit                   U2RXPPS2            __at(0x13A2);	// @ (0x274 * 8 + 2)
#define                                 U2RXPPS2_bit        _BIT_ACCESS(U2RXPPS,2)
// U2RXPPS<U2RXPPS3>
extern volatile __bit                   U2RXPPS3            __at(0x13A3);	// @ (0x274 * 8 + 3)
#define                                 U2RXPPS3_bit        _BIT_ACCESS(U2RXPPS,3)
// U2RXPPS<U2RXPPS4>
extern volatile __bit                   U2RXPPS4            __at(0x13A4);	// @ (0x274 * 8 + 4)
#define                                 U2RXPPS4_bit        _BIT_ACCESS(U2RXPPS,4)
// U2RXPPS<U2RXPPS5>
extern volatile __bit                   U2RXPPS5            __at(0x13A5);	// @ (0x274 * 8 + 5)
#define                                 U2RXPPS5_bit        _BIT_ACCESS(U2RXPPS,5)
// U2CON1<U2SENDB>
extern volatile __bit                   U2SENDB             __at(0x15F8);	// @ (0x2BF * 8 + 0)
#define                                 U2SENDB_bit         _BIT_ACCESS(U2CON1,0)
// U2CON2<U2STP0>
extern volatile __bit                   U2STP0              __at(0x1604);	// @ (0x2C0 * 8 + 4)
#define                                 U2STP0_bit          _BIT_ACCESS(U2CON2,4)
// U2CON2<U2STP1>
extern volatile __bit                   U2STP1              __at(0x1605);	// @ (0x2C0 * 8 + 5)
#define                                 U2STP1_bit          _BIT_ACCESS(U2CON2,5)
// U2FIFO<U2STPMD>
extern volatile __bit                   U2STPMD             __at(0x161E);	// @ (0x2C3 * 8 + 6)
#define                                 U2STPMD_bit         _BIT_ACCESS(U2FIFO,6)
// U2FIFO<U2TXBE>
extern volatile __bit                   U2TXBE              __at(0x161D);	// @ (0x2C3 * 8 + 5)
#define                                 U2TXBE_bit          _BIT_ACCESS(U2FIFO,5)
// U2FIFO<U2TXBF>
extern volatile __bit                   U2TXBF              __at(0x161C);	// @ (0x2C3 * 8 + 4)
#define                                 U2TXBF_bit          _BIT_ACCESS(U2FIFO,4)
// U2ERRIE<U2TXCIE>
extern volatile __bit                   U2TXCIE             __at(0x1630);	// @ (0x2C6 * 8 + 0)
#define                                 U2TXCIE_bit         _BIT_ACCESS(U2ERRIE,0)
// U2ERRIR<U2TXCIF>
extern volatile __bit                   U2TXCIF             __at(0x1628);	// @ (0x2C5 * 8 + 0)
#define                                 U2TXCIF_bit         _BIT_ACCESS(U2ERRIR,0)
// U2CON0<U2TXEN>
extern volatile __bit                   U2TXEN              __at(0x15F5);	// @ (0x2BE * 8 + 5)
#define                                 U2TXEN_bit          _BIT_ACCESS(U2CON0,5)
// PIE8<U2TXIE>
extern volatile __bit                   U2TXIE              __at(0x2579);	// @ (0x4AF * 8 + 1)
#define                                 U2TXIE_bit          _BIT_ACCESS(PIE8,1)
// PIR8<U2TXIF>
extern volatile __bit                   U2TXIF              __at(0x25D1);	// @ (0x4BA * 8 + 1)
#define                                 U2TXIF_bit          _BIT_ACCESS(PIR8,1)
// IPR8<U2TXIP>
extern volatile __bit                   U2TXIP              __at(0x2521);	// @ (0x4A4 * 8 + 1)
#define                                 U2TXIP_bit          _BIT_ACCESS(IPR8,1)
// U2ERRIE<U2TXMTIE>
extern volatile __bit                   U2TXMTIE            __at(0x1637);	// @ (0x2C6 * 8 + 7)
#define                                 U2TXMTIE_bit        _BIT_ACCESS(U2ERRIE,7)
// U2ERRIR<U2TXMTIF>
extern volatile __bit                   U2TXMTIF            __at(0x162F);	// @ (0x2C5 * 8 + 7)
#define                                 U2TXMTIF_bit        _BIT_ACCESS(U2ERRIR,7)
// U2CON2<U2TXPOL>
extern volatile __bit                   U2TXPOL             __at(0x1602);	// @ (0x2C0 * 8 + 2)
#define                                 U2TXPOL_bit         _BIT_ACCESS(U2CON2,2)
// U2FIFO<U2TXWRE>
extern volatile __bit                   U2TXWRE             __at(0x161F);	// @ (0x2C3 * 8 + 7)
#define                                 U2TXWRE_bit         _BIT_ACCESS(U2FIFO,7)
// U2CON1<U2WUE>
extern volatile __bit                   U2WUE               __at(0x15FC);	// @ (0x2BF * 8 + 4)
#define                                 U2WUE_bit           _BIT_ACCESS(U2CON1,4)
// U2UIR<U2WUIF>
extern volatile __bit                   U2WUIF              __at(0x1627);	// @ (0x2C4 * 8 + 7)
#define                                 U2WUIF_bit          _BIT_ACCESS(U2UIR,7)
// U2FIFO<U2XON>
extern volatile __bit                   U2XON               __at(0x161A);	// @ (0x2C3 * 8 + 2)
#define                                 U2XON_bit           _BIT_ACCESS(U2FIFO,2)
// ACTCON<UD>
extern volatile __bit                   UD                  __at(0x566);	// @ (0xAC * 8 + 6)
#define                                 UD_bit              _BIT_ACCESS(ACTCON,6)
// ADUTHL<UTH0>
extern volatile __bit                   UTH0                __at(0x1ED8);	// @ (0x3DB * 8 + 0)
#define                                 UTH0_bit            _BIT_ACCESS(ADUTHL,0)
// ADUTHL<UTH1>
extern volatile __bit                   UTH1                __at(0x1ED9);	// @ (0x3DB * 8 + 1)
#define                                 UTH1_bit            _BIT_ACCESS(ADUTHL,1)
// ADUTHH<UTH10>
extern volatile __bit                   UTH10               __at(0x1EE2);	// @ (0x3DC * 8 + 2)
#define                                 UTH10_bit           _BIT_ACCESS(ADUTHH,2)
// ADUTHH<UTH11>
extern volatile __bit                   UTH11               __at(0x1EE3);	// @ (0x3DC * 8 + 3)
#define                                 UTH11_bit           _BIT_ACCESS(ADUTHH,3)
// ADUTHH<UTH12>
extern volatile __bit                   UTH12               __at(0x1EE4);	// @ (0x3DC * 8 + 4)
#define                                 UTH12_bit           _BIT_ACCESS(ADUTHH,4)
// ADUTHH<UTH13>
extern volatile __bit                   UTH13               __at(0x1EE5);	// @ (0x3DC * 8 + 5)
#define                                 UTH13_bit           _BIT_ACCESS(ADUTHH,5)
// ADUTHH<UTH14>
extern volatile __bit                   UTH14               __at(0x1EE6);	// @ (0x3DC * 8 + 6)
#define                                 UTH14_bit           _BIT_ACCESS(ADUTHH,6)
// ADUTHH<UTH15>
extern volatile __bit                   UTH15               __at(0x1EE7);	// @ (0x3DC * 8 + 7)
#define                                 UTH15_bit           _BIT_ACCESS(ADUTHH,7)
// ADUTHL<UTH2>
extern volatile __bit                   UTH2                __at(0x1EDA);	// @ (0x3DB * 8 + 2)
#define                                 UTH2_bit            _BIT_ACCESS(ADUTHL,2)
// ADUTHL<UTH3>
extern volatile __bit                   UTH3                __at(0x1EDB);	// @ (0x3DB * 8 + 3)
#define                                 UTH3_bit            _BIT_ACCESS(ADUTHL,3)
// ADUTHL<UTH4>
extern volatile __bit                   UTH4                __at(0x1EDC);	// @ (0x3DB * 8 + 4)
#define                                 UTH4_bit            _BIT_ACCESS(ADUTHL,4)
// ADUTHL<UTH5>
extern volatile __bit                   UTH5                __at(0x1EDD);	// @ (0x3DB * 8 + 5)
#define                                 UTH5_bit            _BIT_ACCESS(ADUTHL,5)
// ADUTHL<UTH6>
extern volatile __bit                   UTH6                __at(0x1EDE);	// @ (0x3DB * 8 + 6)
#define                                 UTH6_bit            _BIT_ACCESS(ADUTHL,6)
// ADUTHL<UTH7>
extern volatile __bit                   UTH7                __at(0x1EDF);	// @ (0x3DB * 8 + 7)
#define                                 UTH7_bit            _BIT_ACCESS(ADUTHL,7)
// ADUTHH<UTH8>
extern volatile __bit                   UTH8                __at(0x1EE0);	// @ (0x3DC * 8 + 0)
#define                                 UTH8_bit            _BIT_ACCESS(ADUTHH,0)
// ADUTHH<UTH9>
extern volatile __bit                   UTH9                __at(0x1EE1);	// @ (0x3DC * 8 + 1)
#define                                 UTH9_bit            _BIT_ACCESS(ADUTHH,1)
// ADSTAT<UTHR>
extern volatile __bit                   UTHR                __at(0x1FBE);	// @ (0x3F7 * 8 + 6)
#define                                 UTHR_bit            _BIT_ACCESS(ADSTAT,6)
// VREGCON<VREGPM0>
extern volatile __bit                   VREGPM0             __at(0x240);	// @ (0x48 * 8 + 0)
#define                                 VREGPM0_bit         _BIT_ACCESS(VREGCON,0)
// VREGCON<VREGPM1>
extern volatile __bit                   VREGPM1             __at(0x241);	// @ (0x48 * 8 + 1)
#define                                 VREGPM1_bit         _BIT_ACCESS(VREGCON,1)
// WDTCON1<WDTCS0>
extern volatile __bit                   WDTCS0              __at(0x3CC);	// @ (0x79 * 8 + 4)
#define                                 WDTCS0_bit          _BIT_ACCESS(WDTCON1,4)
// WDTCON1<WDTCS1>
extern volatile __bit                   WDTCS1              __at(0x3CD);	// @ (0x79 * 8 + 5)
#define                                 WDTCS1_bit          _BIT_ACCESS(WDTCON1,5)
// WDTCON1<WDTCS2>
extern volatile __bit                   WDTCS2              __at(0x3CE);	// @ (0x79 * 8 + 6)
#define                                 WDTCS2_bit          _BIT_ACCESS(WDTCON1,6)
// WDTCON0<WDTPS0>
extern volatile __bit                   WDTPS0              __at(0x3C1);	// @ (0x78 * 8 + 1)
#define                                 WDTPS0_bit          _BIT_ACCESS(WDTCON0,1)
// WDTCON0<WDTPS1>
extern volatile __bit                   WDTPS1              __at(0x3C2);	// @ (0x78 * 8 + 2)
#define                                 WDTPS1_bit          _BIT_ACCESS(WDTCON0,2)
// WDTCON0<WDTPS2>
extern volatile __bit                   WDTPS2              __at(0x3C3);	// @ (0x78 * 8 + 3)
#define                                 WDTPS2_bit          _BIT_ACCESS(WDTCON0,3)
// WDTCON0<WDTPS3>
extern volatile __bit                   WDTPS3              __at(0x3C4);	// @ (0x78 * 8 + 4)
#define                                 WDTPS3_bit          _BIT_ACCESS(WDTCON0,4)
// WDTCON0<WDTPS4>
extern volatile __bit                   WDTPS4              __at(0x3C5);	// @ (0x78 * 8 + 5)
#define                                 WDTPS4_bit          _BIT_ACCESS(WDTCON0,5)
// WDTTMR<WDTPSCNT16>
extern volatile __bit                   WDTPSCNT16          __at(0x3E0);	// @ (0x7C * 8 + 0)
#define                                 WDTPSCNT16_bit      _BIT_ACCESS(WDTTMR,0)
// WDTTMR<WDTPSCNT17>
extern volatile __bit                   WDTPSCNT17          __at(0x3E1);	// @ (0x7C * 8 + 1)
#define                                 WDTPSCNT17_bit      _BIT_ACCESS(WDTTMR,1)
// WDTCON0<WDTSEN>
extern volatile __bit                   WDTSEN              __at(0x3C0);	// @ (0x78 * 8 + 0)
#define                                 WDTSEN_bit          _BIT_ACCESS(WDTCON0,0)
// WDTTMR<WDTSTATE>
extern volatile __bit                   WDTSTATE            __at(0x3E2);	// @ (0x7C * 8 + 2)
#define                                 WDTSTATE_bit        _BIT_ACCESS(WDTTMR,2)
// WDTTMR<WDTTMR0>
extern volatile __bit                   WDTTMR0             __at(0x3E3);	// @ (0x7C * 8 + 3)
#define                                 WDTTMR0_bit         _BIT_ACCESS(WDTTMR,3)
// WDTTMR<WDTTMR1>
extern volatile __bit                   WDTTMR1             __at(0x3E4);	// @ (0x7C * 8 + 4)
#define                                 WDTTMR1_bit         _BIT_ACCESS(WDTTMR,4)
// WDTTMR<WDTTMR2>
extern volatile __bit                   WDTTMR2             __at(0x3E5);	// @ (0x7C * 8 + 5)
#define                                 WDTTMR2_bit         _BIT_ACCESS(WDTTMR,5)
// WDTTMR<WDTTMR3>
extern volatile __bit                   WDTTMR3             __at(0x3E6);	// @ (0x7C * 8 + 6)
